/* automatically generated by rust-bindgen 0.71.1 */

pub type __time_t = ::core::ffi::c_long;
pub type time_t = __time_t;
pub type ushort = ::core::ffi::c_ushort;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_UNKNOWN:
  LibRaw_internal_thumbnail_formats = 0;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_KODAK_THUMB:
  LibRaw_internal_thumbnail_formats = 1;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_KODAK_YCBCR:
  LibRaw_internal_thumbnail_formats = 2;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_KODAK_RGB:
  LibRaw_internal_thumbnail_formats = 3;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_JPEG:
  LibRaw_internal_thumbnail_formats = 4;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_LAYER:
  LibRaw_internal_thumbnail_formats = 5;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_ROLLEI:
  LibRaw_internal_thumbnail_formats = 6;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_PPM:
  LibRaw_internal_thumbnail_formats = 7;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_PPM16:
  LibRaw_internal_thumbnail_formats = 8;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_X3F:
  LibRaw_internal_thumbnail_formats = 9;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_DNG_YCBCR:
  LibRaw_internal_thumbnail_formats = 10;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_JPEGXL:
  LibRaw_internal_thumbnail_formats = 11;
pub type LibRaw_internal_thumbnail_formats = ::core::ffi::c_uint;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_UNKNOWN: LibRaw_thumbnail_formats = 0;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_JPEG: LibRaw_thumbnail_formats = 1;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_BITMAP: LibRaw_thumbnail_formats = 2;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_BITMAP16: LibRaw_thumbnail_formats = 3;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_LAYER: LibRaw_thumbnail_formats = 4;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_ROLLEI: LibRaw_thumbnail_formats = 5;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_H265: LibRaw_thumbnail_formats = 6;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_JPEGXL: LibRaw_thumbnail_formats = 7;
pub type LibRaw_thumbnail_formats = ::core::ffi::c_uint;
pub const LibRaw_image_formats_LIBRAW_IMAGE_JPEG: LibRaw_image_formats = 1;
pub const LibRaw_image_formats_LIBRAW_IMAGE_BITMAP: LibRaw_image_formats = 2;
pub const LibRaw_image_formats_LIBRAW_IMAGE_JPEGXL: LibRaw_image_formats = 3;
pub const LibRaw_image_formats_LIBRAW_IMAGE_H265: LibRaw_image_formats = 4;
pub type LibRaw_image_formats = ::core::ffi::c_uint;
pub type INT64 = ::core::ffi::c_longlong;
pub type UINT64 = ::core::ffi::c_ulonglong;
pub type uchar = ::core::ffi::c_uchar;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_internal_output_params_t {
  pub mix_green: ::core::ffi::c_uint,
  pub raw_color: ::core::ffi::c_uint,
  pub zero_is_bad: ::core::ffi::c_uint,
  pub shrink: ushort,
  pub fuji_width: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_internal_output_params_t"]
    [::core::mem::size_of::<libraw_internal_output_params_t>() - 16usize];
  ["Alignment of libraw_internal_output_params_t"]
    [::core::mem::align_of::<libraw_internal_output_params_t>() - 4usize];
  ["Offset of field: libraw_internal_output_params_t::mix_green"]
    [::core::mem::offset_of!(libraw_internal_output_params_t, mix_green) - 0usize];
  ["Offset of field: libraw_internal_output_params_t::raw_color"]
    [::core::mem::offset_of!(libraw_internal_output_params_t, raw_color) - 4usize];
  ["Offset of field: libraw_internal_output_params_t::zero_is_bad"]
    [::core::mem::offset_of!(libraw_internal_output_params_t, zero_is_bad) - 8usize];
  ["Offset of field: libraw_internal_output_params_t::shrink"]
    [::core::mem::offset_of!(libraw_internal_output_params_t, shrink) - 12usize];
  ["Offset of field: libraw_internal_output_params_t::fuji_width"]
    [::core::mem::offset_of!(libraw_internal_output_params_t, fuji_width) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_processed_image_t {
  pub type_: LibRaw_image_formats,
  pub height: ushort,
  pub width: ushort,
  pub colors: ushort,
  pub bits: ushort,
  pub data_size: ::core::ffi::c_uint,
  pub data: [::core::ffi::c_uchar; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_processed_image_t"]
    [::core::mem::size_of::<libraw_processed_image_t>() - 20usize];
  ["Alignment of libraw_processed_image_t"]
    [::core::mem::align_of::<libraw_processed_image_t>() - 4usize];
  ["Offset of field: libraw_processed_image_t::type_"]
    [::core::mem::offset_of!(libraw_processed_image_t, type_) - 0usize];
  ["Offset of field: libraw_processed_image_t::height"]
    [::core::mem::offset_of!(libraw_processed_image_t, height) - 4usize];
  ["Offset of field: libraw_processed_image_t::width"]
    [::core::mem::offset_of!(libraw_processed_image_t, width) - 6usize];
  ["Offset of field: libraw_processed_image_t::colors"]
    [::core::mem::offset_of!(libraw_processed_image_t, colors) - 8usize];
  ["Offset of field: libraw_processed_image_t::bits"]
    [::core::mem::offset_of!(libraw_processed_image_t, bits) - 10usize];
  ["Offset of field: libraw_processed_image_t::data_size"]
    [::core::mem::offset_of!(libraw_processed_image_t, data_size) - 12usize];
  ["Offset of field: libraw_processed_image_t::data"]
    [::core::mem::offset_of!(libraw_processed_image_t, data) - 16usize];
};
impl Default for libraw_processed_image_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_iparams_t {
  pub guard: [::core::ffi::c_char; 4usize],
  pub make: [::core::ffi::c_char; 64usize],
  pub model: [::core::ffi::c_char; 64usize],
  pub software: [::core::ffi::c_char; 64usize],
  pub normalized_make: [::core::ffi::c_char; 64usize],
  pub normalized_model: [::core::ffi::c_char; 64usize],
  pub maker_index: ::core::ffi::c_uint,
  pub raw_count: ::core::ffi::c_uint,
  pub dng_version: ::core::ffi::c_uint,
  pub is_foveon: ::core::ffi::c_uint,
  pub colors: ::core::ffi::c_int,
  pub filters: ::core::ffi::c_uint,
  pub xtrans: [[::core::ffi::c_char; 6usize]; 6usize],
  pub xtrans_abs: [[::core::ffi::c_char; 6usize]; 6usize],
  pub cdesc: [::core::ffi::c_char; 5usize],
  pub xmplen: ::core::ffi::c_uint,
  pub xmpdata: *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_iparams_t"][::core::mem::size_of::<libraw_iparams_t>() - 440usize];
  ["Alignment of libraw_iparams_t"][::core::mem::align_of::<libraw_iparams_t>() - 8usize];
  ["Offset of field: libraw_iparams_t::guard"]
    [::core::mem::offset_of!(libraw_iparams_t, guard) - 0usize];
  ["Offset of field: libraw_iparams_t::make"]
    [::core::mem::offset_of!(libraw_iparams_t, make) - 4usize];
  ["Offset of field: libraw_iparams_t::model"]
    [::core::mem::offset_of!(libraw_iparams_t, model) - 68usize];
  ["Offset of field: libraw_iparams_t::software"]
    [::core::mem::offset_of!(libraw_iparams_t, software) - 132usize];
  ["Offset of field: libraw_iparams_t::normalized_make"]
    [::core::mem::offset_of!(libraw_iparams_t, normalized_make) - 196usize];
  ["Offset of field: libraw_iparams_t::normalized_model"]
    [::core::mem::offset_of!(libraw_iparams_t, normalized_model) - 260usize];
  ["Offset of field: libraw_iparams_t::maker_index"]
    [::core::mem::offset_of!(libraw_iparams_t, maker_index) - 324usize];
  ["Offset of field: libraw_iparams_t::raw_count"]
    [::core::mem::offset_of!(libraw_iparams_t, raw_count) - 328usize];
  ["Offset of field: libraw_iparams_t::dng_version"]
    [::core::mem::offset_of!(libraw_iparams_t, dng_version) - 332usize];
  ["Offset of field: libraw_iparams_t::is_foveon"]
    [::core::mem::offset_of!(libraw_iparams_t, is_foveon) - 336usize];
  ["Offset of field: libraw_iparams_t::colors"]
    [::core::mem::offset_of!(libraw_iparams_t, colors) - 340usize];
  ["Offset of field: libraw_iparams_t::filters"]
    [::core::mem::offset_of!(libraw_iparams_t, filters) - 344usize];
  ["Offset of field: libraw_iparams_t::xtrans"]
    [::core::mem::offset_of!(libraw_iparams_t, xtrans) - 348usize];
  ["Offset of field: libraw_iparams_t::xtrans_abs"]
    [::core::mem::offset_of!(libraw_iparams_t, xtrans_abs) - 384usize];
  ["Offset of field: libraw_iparams_t::cdesc"]
    [::core::mem::offset_of!(libraw_iparams_t, cdesc) - 420usize];
  ["Offset of field: libraw_iparams_t::xmplen"]
    [::core::mem::offset_of!(libraw_iparams_t, xmplen) - 428usize];
  ["Offset of field: libraw_iparams_t::xmpdata"]
    [::core::mem::offset_of!(libraw_iparams_t, xmpdata) - 432usize];
};
impl Default for libraw_iparams_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_raw_inset_crop_t {
  pub cleft: ushort,
  pub ctop: ushort,
  pub cwidth: ushort,
  pub cheight: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_raw_inset_crop_t"][::core::mem::size_of::<libraw_raw_inset_crop_t>() - 8usize];
  ["Alignment of libraw_raw_inset_crop_t"]
    [::core::mem::align_of::<libraw_raw_inset_crop_t>() - 2usize];
  ["Offset of field: libraw_raw_inset_crop_t::cleft"]
    [::core::mem::offset_of!(libraw_raw_inset_crop_t, cleft) - 0usize];
  ["Offset of field: libraw_raw_inset_crop_t::ctop"]
    [::core::mem::offset_of!(libraw_raw_inset_crop_t, ctop) - 2usize];
  ["Offset of field: libraw_raw_inset_crop_t::cwidth"]
    [::core::mem::offset_of!(libraw_raw_inset_crop_t, cwidth) - 4usize];
  ["Offset of field: libraw_raw_inset_crop_t::cheight"]
    [::core::mem::offset_of!(libraw_raw_inset_crop_t, cheight) - 6usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_image_sizes_t {
  pub raw_height: ushort,
  pub raw_width: ushort,
  pub height: ushort,
  pub width: ushort,
  pub top_margin: ushort,
  pub left_margin: ushort,
  pub iheight: ushort,
  pub iwidth: ushort,
  pub raw_pitch: ::core::ffi::c_uint,
  pub pixel_aspect: f64,
  pub flip: ::core::ffi::c_int,
  pub mask: [[::core::ffi::c_int; 4usize]; 8usize],
  pub raw_aspect: ushort,
  pub raw_inset_crops: [libraw_raw_inset_crop_t; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_image_sizes_t"][::core::mem::size_of::<libraw_image_sizes_t>() - 184usize];
  ["Alignment of libraw_image_sizes_t"][::core::mem::align_of::<libraw_image_sizes_t>() - 8usize];
  ["Offset of field: libraw_image_sizes_t::raw_height"]
    [::core::mem::offset_of!(libraw_image_sizes_t, raw_height) - 0usize];
  ["Offset of field: libraw_image_sizes_t::raw_width"]
    [::core::mem::offset_of!(libraw_image_sizes_t, raw_width) - 2usize];
  ["Offset of field: libraw_image_sizes_t::height"]
    [::core::mem::offset_of!(libraw_image_sizes_t, height) - 4usize];
  ["Offset of field: libraw_image_sizes_t::width"]
    [::core::mem::offset_of!(libraw_image_sizes_t, width) - 6usize];
  ["Offset of field: libraw_image_sizes_t::top_margin"]
    [::core::mem::offset_of!(libraw_image_sizes_t, top_margin) - 8usize];
  ["Offset of field: libraw_image_sizes_t::left_margin"]
    [::core::mem::offset_of!(libraw_image_sizes_t, left_margin) - 10usize];
  ["Offset of field: libraw_image_sizes_t::iheight"]
    [::core::mem::offset_of!(libraw_image_sizes_t, iheight) - 12usize];
  ["Offset of field: libraw_image_sizes_t::iwidth"]
    [::core::mem::offset_of!(libraw_image_sizes_t, iwidth) - 14usize];
  ["Offset of field: libraw_image_sizes_t::raw_pitch"]
    [::core::mem::offset_of!(libraw_image_sizes_t, raw_pitch) - 16usize];
  ["Offset of field: libraw_image_sizes_t::pixel_aspect"]
    [::core::mem::offset_of!(libraw_image_sizes_t, pixel_aspect) - 24usize];
  ["Offset of field: libraw_image_sizes_t::flip"]
    [::core::mem::offset_of!(libraw_image_sizes_t, flip) - 32usize];
  ["Offset of field: libraw_image_sizes_t::mask"]
    [::core::mem::offset_of!(libraw_image_sizes_t, mask) - 36usize];
  ["Offset of field: libraw_image_sizes_t::raw_aspect"]
    [::core::mem::offset_of!(libraw_image_sizes_t, raw_aspect) - 164usize];
  ["Offset of field: libraw_image_sizes_t::raw_inset_crops"]
    [::core::mem::offset_of!(libraw_image_sizes_t, raw_inset_crops) - 166usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_area_t {
  pub t: ::core::ffi::c_short,
  pub l: ::core::ffi::c_short,
  pub b: ::core::ffi::c_short,
  pub r: ::core::ffi::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_area_t"][::core::mem::size_of::<libraw_area_t>() - 8usize];
  ["Alignment of libraw_area_t"][::core::mem::align_of::<libraw_area_t>() - 2usize];
  ["Offset of field: libraw_area_t::t"][::core::mem::offset_of!(libraw_area_t, t) - 0usize];
  ["Offset of field: libraw_area_t::l"][::core::mem::offset_of!(libraw_area_t, l) - 2usize];
  ["Offset of field: libraw_area_t::b"][::core::mem::offset_of!(libraw_area_t, b) - 4usize];
  ["Offset of field: libraw_area_t::r"][::core::mem::offset_of!(libraw_area_t, r) - 6usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ph1_t {
  pub format: ::core::ffi::c_int,
  pub key_off: ::core::ffi::c_int,
  pub tag_21a: ::core::ffi::c_int,
  pub t_black: ::core::ffi::c_int,
  pub split_col: ::core::ffi::c_int,
  pub black_col: ::core::ffi::c_int,
  pub split_row: ::core::ffi::c_int,
  pub black_row: ::core::ffi::c_int,
  pub tag_210: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of ph1_t"][::core::mem::size_of::<ph1_t>() - 36usize];
  ["Alignment of ph1_t"][::core::mem::align_of::<ph1_t>() - 4usize];
  ["Offset of field: ph1_t::format"][::core::mem::offset_of!(ph1_t, format) - 0usize];
  ["Offset of field: ph1_t::key_off"][::core::mem::offset_of!(ph1_t, key_off) - 4usize];
  ["Offset of field: ph1_t::tag_21a"][::core::mem::offset_of!(ph1_t, tag_21a) - 8usize];
  ["Offset of field: ph1_t::t_black"][::core::mem::offset_of!(ph1_t, t_black) - 12usize];
  ["Offset of field: ph1_t::split_col"][::core::mem::offset_of!(ph1_t, split_col) - 16usize];
  ["Offset of field: ph1_t::black_col"][::core::mem::offset_of!(ph1_t, black_col) - 20usize];
  ["Offset of field: ph1_t::split_row"][::core::mem::offset_of!(ph1_t, split_row) - 24usize];
  ["Offset of field: ph1_t::black_row"][::core::mem::offset_of!(ph1_t, black_row) - 28usize];
  ["Offset of field: ph1_t::tag_210"][::core::mem::offset_of!(ph1_t, tag_210) - 32usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_dng_color_t {
  pub parsedfields: ::core::ffi::c_uint,
  pub illuminant: ushort,
  pub calibration: [[f32; 4usize]; 4usize],
  pub colormatrix: [[f32; 3usize]; 4usize],
  pub forwardmatrix: [[f32; 4usize]; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_dng_color_t"][::core::mem::size_of::<libraw_dng_color_t>() - 168usize];
  ["Alignment of libraw_dng_color_t"][::core::mem::align_of::<libraw_dng_color_t>() - 4usize];
  ["Offset of field: libraw_dng_color_t::parsedfields"]
    [::core::mem::offset_of!(libraw_dng_color_t, parsedfields) - 0usize];
  ["Offset of field: libraw_dng_color_t::illuminant"]
    [::core::mem::offset_of!(libraw_dng_color_t, illuminant) - 4usize];
  ["Offset of field: libraw_dng_color_t::calibration"]
    [::core::mem::offset_of!(libraw_dng_color_t, calibration) - 8usize];
  ["Offset of field: libraw_dng_color_t::colormatrix"]
    [::core::mem::offset_of!(libraw_dng_color_t, colormatrix) - 72usize];
  ["Offset of field: libraw_dng_color_t::forwardmatrix"]
    [::core::mem::offset_of!(libraw_dng_color_t, forwardmatrix) - 120usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_dng_rawopcode_t {
  pub len: ::core::ffi::c_uint,
  pub data: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_dng_rawopcode_t"][::core::mem::size_of::<libraw_dng_rawopcode_t>() - 16usize];
  ["Alignment of libraw_dng_rawopcode_t"]
    [::core::mem::align_of::<libraw_dng_rawopcode_t>() - 8usize];
  ["Offset of field: libraw_dng_rawopcode_t::len"]
    [::core::mem::offset_of!(libraw_dng_rawopcode_t, len) - 0usize];
  ["Offset of field: libraw_dng_rawopcode_t::data"]
    [::core::mem::offset_of!(libraw_dng_rawopcode_t, data) - 8usize];
};
impl Default for libraw_dng_rawopcode_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_dng_levels_t {
  pub parsedfields: ::core::ffi::c_uint,
  pub dng_cblack: [::core::ffi::c_uint; 4104usize],
  pub dng_black: ::core::ffi::c_uint,
  pub dng_fcblack: [f32; 4104usize],
  pub dng_fblack: f32,
  pub dng_whitelevel: [::core::ffi::c_uint; 4usize],
  pub default_crop: [ushort; 4usize],
  pub user_crop: [f32; 4usize],
  pub preview_colorspace: ::core::ffi::c_uint,
  pub analogbalance: [f32; 4usize],
  pub asshotneutral: [f32; 4usize],
  pub baseline_exposure: f32,
  pub LinearResponseLimit: f32,
  pub rawopcodes: [libraw_dng_rawopcode_t; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_dng_levels_t"][::core::mem::size_of::<libraw_dng_levels_t>() - 32976usize];
  ["Alignment of libraw_dng_levels_t"][::core::mem::align_of::<libraw_dng_levels_t>() - 8usize];
  ["Offset of field: libraw_dng_levels_t::parsedfields"]
    [::core::mem::offset_of!(libraw_dng_levels_t, parsedfields) - 0usize];
  ["Offset of field: libraw_dng_levels_t::dng_cblack"]
    [::core::mem::offset_of!(libraw_dng_levels_t, dng_cblack) - 4usize];
  ["Offset of field: libraw_dng_levels_t::dng_black"]
    [::core::mem::offset_of!(libraw_dng_levels_t, dng_black) - 16420usize];
  ["Offset of field: libraw_dng_levels_t::dng_fcblack"]
    [::core::mem::offset_of!(libraw_dng_levels_t, dng_fcblack) - 16424usize];
  ["Offset of field: libraw_dng_levels_t::dng_fblack"]
    [::core::mem::offset_of!(libraw_dng_levels_t, dng_fblack) - 32840usize];
  ["Offset of field: libraw_dng_levels_t::dng_whitelevel"]
    [::core::mem::offset_of!(libraw_dng_levels_t, dng_whitelevel) - 32844usize];
  ["Offset of field: libraw_dng_levels_t::default_crop"]
    [::core::mem::offset_of!(libraw_dng_levels_t, default_crop) - 32860usize];
  ["Offset of field: libraw_dng_levels_t::user_crop"]
    [::core::mem::offset_of!(libraw_dng_levels_t, user_crop) - 32868usize];
  ["Offset of field: libraw_dng_levels_t::preview_colorspace"]
    [::core::mem::offset_of!(libraw_dng_levels_t, preview_colorspace) - 32884usize];
  ["Offset of field: libraw_dng_levels_t::analogbalance"]
    [::core::mem::offset_of!(libraw_dng_levels_t, analogbalance) - 32888usize];
  ["Offset of field: libraw_dng_levels_t::asshotneutral"]
    [::core::mem::offset_of!(libraw_dng_levels_t, asshotneutral) - 32904usize];
  ["Offset of field: libraw_dng_levels_t::baseline_exposure"]
    [::core::mem::offset_of!(libraw_dng_levels_t, baseline_exposure) - 32920usize];
  ["Offset of field: libraw_dng_levels_t::LinearResponseLimit"]
    [::core::mem::offset_of!(libraw_dng_levels_t, LinearResponseLimit) - 32924usize];
  ["Offset of field: libraw_dng_levels_t::rawopcodes"]
    [::core::mem::offset_of!(libraw_dng_levels_t, rawopcodes) - 32928usize];
};
impl Default for libraw_dng_levels_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_P1_color_t {
  pub romm_cam: [f32; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_P1_color_t"][::core::mem::size_of::<libraw_P1_color_t>() - 36usize];
  ["Alignment of libraw_P1_color_t"][::core::mem::align_of::<libraw_P1_color_t>() - 4usize];
  ["Offset of field: libraw_P1_color_t::romm_cam"]
    [::core::mem::offset_of!(libraw_P1_color_t, romm_cam) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_canon_makernotes_t {
  pub ColorDataVer: ::core::ffi::c_int,
  pub ColorDataSubVer: ::core::ffi::c_int,
  pub SpecularWhiteLevel: ::core::ffi::c_int,
  pub NormalWhiteLevel: ::core::ffi::c_int,
  pub ChannelBlackLevel: [::core::ffi::c_int; 4usize],
  pub AverageBlackLevel: ::core::ffi::c_int,
  pub multishot: [::core::ffi::c_uint; 4usize],
  pub MeteringMode: ::core::ffi::c_short,
  pub SpotMeteringMode: ::core::ffi::c_short,
  pub FlashMeteringMode: uchar,
  pub FlashExposureLock: ::core::ffi::c_short,
  pub ExposureMode: ::core::ffi::c_short,
  pub AESetting: ::core::ffi::c_short,
  pub ImageStabilization: ::core::ffi::c_short,
  pub FlashMode: ::core::ffi::c_short,
  pub FlashActivity: ::core::ffi::c_short,
  pub FlashBits: ::core::ffi::c_short,
  pub ManualFlashOutput: ::core::ffi::c_short,
  pub FlashOutput: ::core::ffi::c_short,
  pub FlashGuideNumber: ::core::ffi::c_short,
  pub ContinuousDrive: ::core::ffi::c_short,
  pub SensorWidth: ::core::ffi::c_short,
  pub SensorHeight: ::core::ffi::c_short,
  pub AFMicroAdjMode: ::core::ffi::c_int,
  pub AFMicroAdjValue: f32,
  pub MakernotesFlip: ::core::ffi::c_short,
  pub AutoRotateMode: ::core::ffi::c_short,
  pub RecordMode: ::core::ffi::c_short,
  pub SRAWQuality: ::core::ffi::c_short,
  pub wbi: ::core::ffi::c_uint,
  pub RF_lensID: ::core::ffi::c_short,
  pub AutoLightingOptimizer: ::core::ffi::c_int,
  pub HighlightTonePriority: ::core::ffi::c_int,
  pub Quality: ::core::ffi::c_short,
  pub CanonLog: ::core::ffi::c_int,
  pub DefaultCropAbsolute: libraw_area_t,
  pub RecommendedImageArea: libraw_area_t,
  pub LeftOpticalBlack: libraw_area_t,
  pub UpperOpticalBlack: libraw_area_t,
  pub ActiveArea: libraw_area_t,
  pub ISOgain: [::core::ffi::c_short; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_canon_makernotes_t"]
    [::core::mem::size_of::<libraw_canon_makernotes_t>() - 168usize];
  ["Alignment of libraw_canon_makernotes_t"]
    [::core::mem::align_of::<libraw_canon_makernotes_t>() - 4usize];
  ["Offset of field: libraw_canon_makernotes_t::ColorDataVer"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, ColorDataVer) - 0usize];
  ["Offset of field: libraw_canon_makernotes_t::ColorDataSubVer"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, ColorDataSubVer) - 4usize];
  ["Offset of field: libraw_canon_makernotes_t::SpecularWhiteLevel"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, SpecularWhiteLevel) - 8usize];
  ["Offset of field: libraw_canon_makernotes_t::NormalWhiteLevel"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, NormalWhiteLevel) - 12usize];
  ["Offset of field: libraw_canon_makernotes_t::ChannelBlackLevel"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, ChannelBlackLevel) - 16usize];
  ["Offset of field: libraw_canon_makernotes_t::AverageBlackLevel"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, AverageBlackLevel) - 32usize];
  ["Offset of field: libraw_canon_makernotes_t::multishot"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, multishot) - 36usize];
  ["Offset of field: libraw_canon_makernotes_t::MeteringMode"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, MeteringMode) - 52usize];
  ["Offset of field: libraw_canon_makernotes_t::SpotMeteringMode"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, SpotMeteringMode) - 54usize];
  ["Offset of field: libraw_canon_makernotes_t::FlashMeteringMode"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, FlashMeteringMode) - 56usize];
  ["Offset of field: libraw_canon_makernotes_t::FlashExposureLock"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, FlashExposureLock) - 58usize];
  ["Offset of field: libraw_canon_makernotes_t::ExposureMode"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, ExposureMode) - 60usize];
  ["Offset of field: libraw_canon_makernotes_t::AESetting"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, AESetting) - 62usize];
  ["Offset of field: libraw_canon_makernotes_t::ImageStabilization"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, ImageStabilization) - 64usize];
  ["Offset of field: libraw_canon_makernotes_t::FlashMode"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, FlashMode) - 66usize];
  ["Offset of field: libraw_canon_makernotes_t::FlashActivity"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, FlashActivity) - 68usize];
  ["Offset of field: libraw_canon_makernotes_t::FlashBits"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, FlashBits) - 70usize];
  ["Offset of field: libraw_canon_makernotes_t::ManualFlashOutput"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, ManualFlashOutput) - 72usize];
  ["Offset of field: libraw_canon_makernotes_t::FlashOutput"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, FlashOutput) - 74usize];
  ["Offset of field: libraw_canon_makernotes_t::FlashGuideNumber"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, FlashGuideNumber) - 76usize];
  ["Offset of field: libraw_canon_makernotes_t::ContinuousDrive"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, ContinuousDrive) - 78usize];
  ["Offset of field: libraw_canon_makernotes_t::SensorWidth"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, SensorWidth) - 80usize];
  ["Offset of field: libraw_canon_makernotes_t::SensorHeight"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, SensorHeight) - 82usize];
  ["Offset of field: libraw_canon_makernotes_t::AFMicroAdjMode"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, AFMicroAdjMode) - 84usize];
  ["Offset of field: libraw_canon_makernotes_t::AFMicroAdjValue"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, AFMicroAdjValue) - 88usize];
  ["Offset of field: libraw_canon_makernotes_t::MakernotesFlip"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, MakernotesFlip) - 92usize];
  ["Offset of field: libraw_canon_makernotes_t::AutoRotateMode"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, AutoRotateMode) - 94usize];
  ["Offset of field: libraw_canon_makernotes_t::RecordMode"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, RecordMode) - 96usize];
  ["Offset of field: libraw_canon_makernotes_t::SRAWQuality"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, SRAWQuality) - 98usize];
  ["Offset of field: libraw_canon_makernotes_t::wbi"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, wbi) - 100usize];
  ["Offset of field: libraw_canon_makernotes_t::RF_lensID"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, RF_lensID) - 104usize];
  ["Offset of field: libraw_canon_makernotes_t::AutoLightingOptimizer"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, AutoLightingOptimizer) - 108usize];
  ["Offset of field: libraw_canon_makernotes_t::HighlightTonePriority"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, HighlightTonePriority) - 112usize];
  ["Offset of field: libraw_canon_makernotes_t::Quality"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, Quality) - 116usize];
  ["Offset of field: libraw_canon_makernotes_t::CanonLog"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, CanonLog) - 120usize];
  ["Offset of field: libraw_canon_makernotes_t::DefaultCropAbsolute"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, DefaultCropAbsolute) - 124usize];
  ["Offset of field: libraw_canon_makernotes_t::RecommendedImageArea"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, RecommendedImageArea) - 132usize];
  ["Offset of field: libraw_canon_makernotes_t::LeftOpticalBlack"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, LeftOpticalBlack) - 140usize];
  ["Offset of field: libraw_canon_makernotes_t::UpperOpticalBlack"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, UpperOpticalBlack) - 148usize];
  ["Offset of field: libraw_canon_makernotes_t::ActiveArea"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, ActiveArea) - 156usize];
  ["Offset of field: libraw_canon_makernotes_t::ISOgain"]
    [::core::mem::offset_of!(libraw_canon_makernotes_t, ISOgain) - 164usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_hasselblad_makernotes_t {
  pub BaseISO: ::core::ffi::c_int,
  pub Gain: f64,
  pub Sensor: [::core::ffi::c_char; 8usize],
  pub SensorUnit: [::core::ffi::c_char; 64usize],
  pub HostBody: [::core::ffi::c_char; 64usize],
  pub SensorCode: ::core::ffi::c_int,
  pub SensorSubCode: ::core::ffi::c_int,
  pub CoatingCode: ::core::ffi::c_int,
  pub uncropped: ::core::ffi::c_int,
  pub CaptureSequenceInitiator: [::core::ffi::c_char; 32usize],
  pub SensorUnitConnector: [::core::ffi::c_char; 64usize],
  pub format: ::core::ffi::c_int,
  pub nIFD_CM: [::core::ffi::c_int; 2usize],
  pub RecommendedCrop: [::core::ffi::c_int; 2usize],
  pub mnColorMatrix: [[f64; 3usize]; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_hasselblad_makernotes_t"]
    [::core::mem::size_of::<libraw_hasselblad_makernotes_t>() - 384usize];
  ["Alignment of libraw_hasselblad_makernotes_t"]
    [::core::mem::align_of::<libraw_hasselblad_makernotes_t>() - 8usize];
  ["Offset of field: libraw_hasselblad_makernotes_t::BaseISO"]
    [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, BaseISO) - 0usize];
  ["Offset of field: libraw_hasselblad_makernotes_t::Gain"]
    [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, Gain) - 8usize];
  ["Offset of field: libraw_hasselblad_makernotes_t::Sensor"]
    [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, Sensor) - 16usize];
  ["Offset of field: libraw_hasselblad_makernotes_t::SensorUnit"]
    [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, SensorUnit) - 24usize];
  ["Offset of field: libraw_hasselblad_makernotes_t::HostBody"]
    [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, HostBody) - 88usize];
  ["Offset of field: libraw_hasselblad_makernotes_t::SensorCode"]
    [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, SensorCode) - 152usize];
  ["Offset of field: libraw_hasselblad_makernotes_t::SensorSubCode"]
    [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, SensorSubCode) - 156usize];
  ["Offset of field: libraw_hasselblad_makernotes_t::CoatingCode"]
    [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, CoatingCode) - 160usize];
  ["Offset of field: libraw_hasselblad_makernotes_t::uncropped"]
    [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, uncropped) - 164usize];
  ["Offset of field: libraw_hasselblad_makernotes_t::CaptureSequenceInitiator"]
    [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, CaptureSequenceInitiator) - 168usize];
  ["Offset of field: libraw_hasselblad_makernotes_t::SensorUnitConnector"]
    [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, SensorUnitConnector) - 200usize];
  ["Offset of field: libraw_hasselblad_makernotes_t::format"]
    [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, format) - 264usize];
  ["Offset of field: libraw_hasselblad_makernotes_t::nIFD_CM"]
    [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, nIFD_CM) - 268usize];
  ["Offset of field: libraw_hasselblad_makernotes_t::RecommendedCrop"]
    [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, RecommendedCrop) - 276usize];
  ["Offset of field: libraw_hasselblad_makernotes_t::mnColorMatrix"]
    [::core::mem::offset_of!(libraw_hasselblad_makernotes_t, mnColorMatrix) - 288usize];
};
impl Default for libraw_hasselblad_makernotes_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_fuji_info_t {
  pub ExpoMidPointShift: f32,
  pub DynamicRange: ushort,
  pub FilmMode: ushort,
  pub DynamicRangeSetting: ushort,
  pub DevelopmentDynamicRange: ushort,
  pub AutoDynamicRange: ushort,
  pub DRangePriority: ushort,
  pub DRangePriorityAuto: ushort,
  pub DRangePriorityFixed: ushort,
  pub FujiModel: [::core::ffi::c_char; 33usize],
  pub FujiModel2: [::core::ffi::c_char; 33usize],
  pub BrightnessCompensation: f32,
  pub FocusMode: ushort,
  pub AFMode: ushort,
  pub FocusPixel: [ushort; 2usize],
  pub PrioritySettings: ushort,
  pub FocusSettings: ::core::ffi::c_uint,
  pub AF_C_Settings: ::core::ffi::c_uint,
  pub FocusWarning: ushort,
  pub ImageStabilization: [ushort; 3usize],
  pub FlashMode: ushort,
  pub WB_Preset: ushort,
  pub ShutterType: ushort,
  pub ExrMode: ushort,
  pub Macro: ushort,
  pub Rating: ::core::ffi::c_uint,
  pub CropMode: ushort,
  pub SerialSignature: [::core::ffi::c_char; 13usize],
  pub SensorID: [::core::ffi::c_char; 5usize],
  pub RAFVersion: [::core::ffi::c_char; 5usize],
  pub RAFDataGeneration: ::core::ffi::c_int,
  pub RAFDataVersion: ushort,
  pub isTSNERDTS: ::core::ffi::c_int,
  pub DriveMode: ::core::ffi::c_short,
  pub BlackLevel: [ushort; 9usize],
  pub RAFData_ImageSizeTable: [::core::ffi::c_uint; 32usize],
  pub AutoBracketing: ::core::ffi::c_int,
  pub SequenceNumber: ::core::ffi::c_int,
  pub SeriesLength: ::core::ffi::c_int,
  pub PixelShiftOffset: [f32; 2usize],
  pub ImageCount: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_fuji_info_t"][::core::mem::size_of::<libraw_fuji_info_t>() - 348usize];
  ["Alignment of libraw_fuji_info_t"][::core::mem::align_of::<libraw_fuji_info_t>() - 4usize];
  ["Offset of field: libraw_fuji_info_t::ExpoMidPointShift"]
    [::core::mem::offset_of!(libraw_fuji_info_t, ExpoMidPointShift) - 0usize];
  ["Offset of field: libraw_fuji_info_t::DynamicRange"]
    [::core::mem::offset_of!(libraw_fuji_info_t, DynamicRange) - 4usize];
  ["Offset of field: libraw_fuji_info_t::FilmMode"]
    [::core::mem::offset_of!(libraw_fuji_info_t, FilmMode) - 6usize];
  ["Offset of field: libraw_fuji_info_t::DynamicRangeSetting"]
    [::core::mem::offset_of!(libraw_fuji_info_t, DynamicRangeSetting) - 8usize];
  ["Offset of field: libraw_fuji_info_t::DevelopmentDynamicRange"]
    [::core::mem::offset_of!(libraw_fuji_info_t, DevelopmentDynamicRange) - 10usize];
  ["Offset of field: libraw_fuji_info_t::AutoDynamicRange"]
    [::core::mem::offset_of!(libraw_fuji_info_t, AutoDynamicRange) - 12usize];
  ["Offset of field: libraw_fuji_info_t::DRangePriority"]
    [::core::mem::offset_of!(libraw_fuji_info_t, DRangePriority) - 14usize];
  ["Offset of field: libraw_fuji_info_t::DRangePriorityAuto"]
    [::core::mem::offset_of!(libraw_fuji_info_t, DRangePriorityAuto) - 16usize];
  ["Offset of field: libraw_fuji_info_t::DRangePriorityFixed"]
    [::core::mem::offset_of!(libraw_fuji_info_t, DRangePriorityFixed) - 18usize];
  ["Offset of field: libraw_fuji_info_t::FujiModel"]
    [::core::mem::offset_of!(libraw_fuji_info_t, FujiModel) - 20usize];
  ["Offset of field: libraw_fuji_info_t::FujiModel2"]
    [::core::mem::offset_of!(libraw_fuji_info_t, FujiModel2) - 53usize];
  ["Offset of field: libraw_fuji_info_t::BrightnessCompensation"]
    [::core::mem::offset_of!(libraw_fuji_info_t, BrightnessCompensation) - 88usize];
  ["Offset of field: libraw_fuji_info_t::FocusMode"]
    [::core::mem::offset_of!(libraw_fuji_info_t, FocusMode) - 92usize];
  ["Offset of field: libraw_fuji_info_t::AFMode"]
    [::core::mem::offset_of!(libraw_fuji_info_t, AFMode) - 94usize];
  ["Offset of field: libraw_fuji_info_t::FocusPixel"]
    [::core::mem::offset_of!(libraw_fuji_info_t, FocusPixel) - 96usize];
  ["Offset of field: libraw_fuji_info_t::PrioritySettings"]
    [::core::mem::offset_of!(libraw_fuji_info_t, PrioritySettings) - 100usize];
  ["Offset of field: libraw_fuji_info_t::FocusSettings"]
    [::core::mem::offset_of!(libraw_fuji_info_t, FocusSettings) - 104usize];
  ["Offset of field: libraw_fuji_info_t::AF_C_Settings"]
    [::core::mem::offset_of!(libraw_fuji_info_t, AF_C_Settings) - 108usize];
  ["Offset of field: libraw_fuji_info_t::FocusWarning"]
    [::core::mem::offset_of!(libraw_fuji_info_t, FocusWarning) - 112usize];
  ["Offset of field: libraw_fuji_info_t::ImageStabilization"]
    [::core::mem::offset_of!(libraw_fuji_info_t, ImageStabilization) - 114usize];
  ["Offset of field: libraw_fuji_info_t::FlashMode"]
    [::core::mem::offset_of!(libraw_fuji_info_t, FlashMode) - 120usize];
  ["Offset of field: libraw_fuji_info_t::WB_Preset"]
    [::core::mem::offset_of!(libraw_fuji_info_t, WB_Preset) - 122usize];
  ["Offset of field: libraw_fuji_info_t::ShutterType"]
    [::core::mem::offset_of!(libraw_fuji_info_t, ShutterType) - 124usize];
  ["Offset of field: libraw_fuji_info_t::ExrMode"]
    [::core::mem::offset_of!(libraw_fuji_info_t, ExrMode) - 126usize];
  ["Offset of field: libraw_fuji_info_t::Macro"]
    [::core::mem::offset_of!(libraw_fuji_info_t, Macro) - 128usize];
  ["Offset of field: libraw_fuji_info_t::Rating"]
    [::core::mem::offset_of!(libraw_fuji_info_t, Rating) - 132usize];
  ["Offset of field: libraw_fuji_info_t::CropMode"]
    [::core::mem::offset_of!(libraw_fuji_info_t, CropMode) - 136usize];
  ["Offset of field: libraw_fuji_info_t::SerialSignature"]
    [::core::mem::offset_of!(libraw_fuji_info_t, SerialSignature) - 138usize];
  ["Offset of field: libraw_fuji_info_t::SensorID"]
    [::core::mem::offset_of!(libraw_fuji_info_t, SensorID) - 151usize];
  ["Offset of field: libraw_fuji_info_t::RAFVersion"]
    [::core::mem::offset_of!(libraw_fuji_info_t, RAFVersion) - 156usize];
  ["Offset of field: libraw_fuji_info_t::RAFDataGeneration"]
    [::core::mem::offset_of!(libraw_fuji_info_t, RAFDataGeneration) - 164usize];
  ["Offset of field: libraw_fuji_info_t::RAFDataVersion"]
    [::core::mem::offset_of!(libraw_fuji_info_t, RAFDataVersion) - 168usize];
  ["Offset of field: libraw_fuji_info_t::isTSNERDTS"]
    [::core::mem::offset_of!(libraw_fuji_info_t, isTSNERDTS) - 172usize];
  ["Offset of field: libraw_fuji_info_t::DriveMode"]
    [::core::mem::offset_of!(libraw_fuji_info_t, DriveMode) - 176usize];
  ["Offset of field: libraw_fuji_info_t::BlackLevel"]
    [::core::mem::offset_of!(libraw_fuji_info_t, BlackLevel) - 178usize];
  ["Offset of field: libraw_fuji_info_t::RAFData_ImageSizeTable"]
    [::core::mem::offset_of!(libraw_fuji_info_t, RAFData_ImageSizeTable) - 196usize];
  ["Offset of field: libraw_fuji_info_t::AutoBracketing"]
    [::core::mem::offset_of!(libraw_fuji_info_t, AutoBracketing) - 324usize];
  ["Offset of field: libraw_fuji_info_t::SequenceNumber"]
    [::core::mem::offset_of!(libraw_fuji_info_t, SequenceNumber) - 328usize];
  ["Offset of field: libraw_fuji_info_t::SeriesLength"]
    [::core::mem::offset_of!(libraw_fuji_info_t, SeriesLength) - 332usize];
  ["Offset of field: libraw_fuji_info_t::PixelShiftOffset"]
    [::core::mem::offset_of!(libraw_fuji_info_t, PixelShiftOffset) - 336usize];
  ["Offset of field: libraw_fuji_info_t::ImageCount"]
    [::core::mem::offset_of!(libraw_fuji_info_t, ImageCount) - 344usize];
};
impl Default for libraw_fuji_info_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_sensor_highspeed_crop_t {
  pub cleft: ushort,
  pub ctop: ushort,
  pub cwidth: ushort,
  pub cheight: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_sensor_highspeed_crop_t"]
    [::core::mem::size_of::<libraw_sensor_highspeed_crop_t>() - 8usize];
  ["Alignment of libraw_sensor_highspeed_crop_t"]
    [::core::mem::align_of::<libraw_sensor_highspeed_crop_t>() - 2usize];
  ["Offset of field: libraw_sensor_highspeed_crop_t::cleft"]
    [::core::mem::offset_of!(libraw_sensor_highspeed_crop_t, cleft) - 0usize];
  ["Offset of field: libraw_sensor_highspeed_crop_t::ctop"]
    [::core::mem::offset_of!(libraw_sensor_highspeed_crop_t, ctop) - 2usize];
  ["Offset of field: libraw_sensor_highspeed_crop_t::cwidth"]
    [::core::mem::offset_of!(libraw_sensor_highspeed_crop_t, cwidth) - 4usize];
  ["Offset of field: libraw_sensor_highspeed_crop_t::cheight"]
    [::core::mem::offset_of!(libraw_sensor_highspeed_crop_t, cheight) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_nikon_makernotes_t {
  pub ExposureBracketValue: f64,
  pub ActiveDLighting: ushort,
  pub ShootingMode: ushort,
  pub ImageStabilization: [uchar; 7usize],
  pub VibrationReduction: uchar,
  pub VRMode: uchar,
  pub FlashSetting: [::core::ffi::c_char; 13usize],
  pub FlashType: [::core::ffi::c_char; 20usize],
  pub FlashExposureCompensation: [uchar; 4usize],
  pub ExternalFlashExposureComp: [uchar; 4usize],
  pub FlashExposureBracketValue: [uchar; 4usize],
  pub FlashMode: uchar,
  pub FlashExposureCompensation2: ::core::ffi::c_schar,
  pub FlashExposureCompensation3: ::core::ffi::c_schar,
  pub FlashExposureCompensation4: ::core::ffi::c_schar,
  pub FlashSource: uchar,
  pub FlashFirmware: [uchar; 2usize],
  pub ExternalFlashFlags: uchar,
  pub FlashControlCommanderMode: uchar,
  pub FlashOutputAndCompensation: uchar,
  pub FlashFocalLength: uchar,
  pub FlashGNDistance: uchar,
  pub FlashGroupControlMode: [uchar; 4usize],
  pub FlashGroupOutputAndCompensation: [uchar; 4usize],
  pub FlashColorFilter: uchar,
  pub NEFCompression: ushort,
  pub ExposureMode: ::core::ffi::c_int,
  pub ExposureProgram: ::core::ffi::c_int,
  pub nMEshots: ::core::ffi::c_int,
  pub MEgainOn: ::core::ffi::c_int,
  pub ME_WB: [f64; 4usize],
  pub AFFineTune: uchar,
  pub AFFineTuneIndex: uchar,
  pub AFFineTuneAdj: i8,
  pub LensDataVersion: ::core::ffi::c_uint,
  pub FlashInfoVersion: ::core::ffi::c_uint,
  pub ColorBalanceVersion: ::core::ffi::c_uint,
  pub key: uchar,
  pub NEFBitDepth: [ushort; 4usize],
  pub HighSpeedCropFormat: ushort,
  pub SensorHighSpeedCrop: libraw_sensor_highspeed_crop_t,
  pub SensorWidth: ushort,
  pub SensorHeight: ushort,
  pub Active_D_Lighting: ushort,
  pub PictureControlVersion: ::core::ffi::c_uint,
  pub PictureControlName: [::core::ffi::c_char; 20usize],
  pub PictureControlBase: [::core::ffi::c_char; 20usize],
  pub ShotInfoVersion: ::core::ffi::c_uint,
  pub ShotInfoFirmware: [::core::ffi::c_char; 9usize],
  pub BurstTable_0x0056_len: ::core::ffi::c_uint,
  pub BurstTable_0x0056: *mut uchar,
  pub BurstTable_0x0056_ver: ushort,
  pub BurstTable_0x0056_gid: ushort,
  pub BurstTable_0x0056_fnum: uchar,
  pub MakernotesFlip: ::core::ffi::c_short,
  pub RollAngle: f64,
  pub PitchAngle: f64,
  pub YawAngle: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_nikon_makernotes_t"]
    [::core::mem::size_of::<libraw_nikon_makernotes_t>() - 296usize];
  ["Alignment of libraw_nikon_makernotes_t"]
    [::core::mem::align_of::<libraw_nikon_makernotes_t>() - 8usize];
  ["Offset of field: libraw_nikon_makernotes_t::ExposureBracketValue"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, ExposureBracketValue) - 0usize];
  ["Offset of field: libraw_nikon_makernotes_t::ActiveDLighting"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, ActiveDLighting) - 8usize];
  ["Offset of field: libraw_nikon_makernotes_t::ShootingMode"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, ShootingMode) - 10usize];
  ["Offset of field: libraw_nikon_makernotes_t::ImageStabilization"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, ImageStabilization) - 12usize];
  ["Offset of field: libraw_nikon_makernotes_t::VibrationReduction"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, VibrationReduction) - 19usize];
  ["Offset of field: libraw_nikon_makernotes_t::VRMode"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, VRMode) - 20usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashSetting"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashSetting) - 21usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashType"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashType) - 34usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashExposureCompensation"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashExposureCompensation) - 54usize];
  ["Offset of field: libraw_nikon_makernotes_t::ExternalFlashExposureComp"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, ExternalFlashExposureComp) - 58usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashExposureBracketValue"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashExposureBracketValue) - 62usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashMode"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashMode) - 66usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashExposureCompensation2"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashExposureCompensation2) - 67usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashExposureCompensation3"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashExposureCompensation3) - 68usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashExposureCompensation4"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashExposureCompensation4) - 69usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashSource"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashSource) - 70usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashFirmware"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashFirmware) - 71usize];
  ["Offset of field: libraw_nikon_makernotes_t::ExternalFlashFlags"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, ExternalFlashFlags) - 73usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashControlCommanderMode"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashControlCommanderMode) - 74usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashOutputAndCompensation"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashOutputAndCompensation) - 75usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashFocalLength"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashFocalLength) - 76usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashGNDistance"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashGNDistance) - 77usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashGroupControlMode"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashGroupControlMode) - 78usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashGroupOutputAndCompensation"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashGroupOutputAndCompensation) - 82usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashColorFilter"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashColorFilter) - 86usize];
  ["Offset of field: libraw_nikon_makernotes_t::NEFCompression"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, NEFCompression) - 88usize];
  ["Offset of field: libraw_nikon_makernotes_t::ExposureMode"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, ExposureMode) - 92usize];
  ["Offset of field: libraw_nikon_makernotes_t::ExposureProgram"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, ExposureProgram) - 96usize];
  ["Offset of field: libraw_nikon_makernotes_t::nMEshots"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, nMEshots) - 100usize];
  ["Offset of field: libraw_nikon_makernotes_t::MEgainOn"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, MEgainOn) - 104usize];
  ["Offset of field: libraw_nikon_makernotes_t::ME_WB"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, ME_WB) - 112usize];
  ["Offset of field: libraw_nikon_makernotes_t::AFFineTune"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, AFFineTune) - 144usize];
  ["Offset of field: libraw_nikon_makernotes_t::AFFineTuneIndex"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, AFFineTuneIndex) - 145usize];
  ["Offset of field: libraw_nikon_makernotes_t::AFFineTuneAdj"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, AFFineTuneAdj) - 146usize];
  ["Offset of field: libraw_nikon_makernotes_t::LensDataVersion"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, LensDataVersion) - 148usize];
  ["Offset of field: libraw_nikon_makernotes_t::FlashInfoVersion"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, FlashInfoVersion) - 152usize];
  ["Offset of field: libraw_nikon_makernotes_t::ColorBalanceVersion"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, ColorBalanceVersion) - 156usize];
  ["Offset of field: libraw_nikon_makernotes_t::key"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, key) - 160usize];
  ["Offset of field: libraw_nikon_makernotes_t::NEFBitDepth"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, NEFBitDepth) - 162usize];
  ["Offset of field: libraw_nikon_makernotes_t::HighSpeedCropFormat"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, HighSpeedCropFormat) - 170usize];
  ["Offset of field: libraw_nikon_makernotes_t::SensorHighSpeedCrop"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, SensorHighSpeedCrop) - 172usize];
  ["Offset of field: libraw_nikon_makernotes_t::SensorWidth"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, SensorWidth) - 180usize];
  ["Offset of field: libraw_nikon_makernotes_t::SensorHeight"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, SensorHeight) - 182usize];
  ["Offset of field: libraw_nikon_makernotes_t::Active_D_Lighting"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, Active_D_Lighting) - 184usize];
  ["Offset of field: libraw_nikon_makernotes_t::PictureControlVersion"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, PictureControlVersion) - 188usize];
  ["Offset of field: libraw_nikon_makernotes_t::PictureControlName"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, PictureControlName) - 192usize];
  ["Offset of field: libraw_nikon_makernotes_t::PictureControlBase"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, PictureControlBase) - 212usize];
  ["Offset of field: libraw_nikon_makernotes_t::ShotInfoVersion"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, ShotInfoVersion) - 232usize];
  ["Offset of field: libraw_nikon_makernotes_t::ShotInfoFirmware"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, ShotInfoFirmware) - 236usize];
  ["Offset of field: libraw_nikon_makernotes_t::BurstTable_0x0056_len"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, BurstTable_0x0056_len) - 248usize];
  ["Offset of field: libraw_nikon_makernotes_t::BurstTable_0x0056"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, BurstTable_0x0056) - 256usize];
  ["Offset of field: libraw_nikon_makernotes_t::BurstTable_0x0056_ver"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, BurstTable_0x0056_ver) - 264usize];
  ["Offset of field: libraw_nikon_makernotes_t::BurstTable_0x0056_gid"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, BurstTable_0x0056_gid) - 266usize];
  ["Offset of field: libraw_nikon_makernotes_t::BurstTable_0x0056_fnum"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, BurstTable_0x0056_fnum) - 268usize];
  ["Offset of field: libraw_nikon_makernotes_t::MakernotesFlip"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, MakernotesFlip) - 270usize];
  ["Offset of field: libraw_nikon_makernotes_t::RollAngle"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, RollAngle) - 272usize];
  ["Offset of field: libraw_nikon_makernotes_t::PitchAngle"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, PitchAngle) - 280usize];
  ["Offset of field: libraw_nikon_makernotes_t::YawAngle"]
    [::core::mem::offset_of!(libraw_nikon_makernotes_t, YawAngle) - 288usize];
};
impl Default for libraw_nikon_makernotes_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_olympus_makernotes_t {
  pub CameraType2: [::core::ffi::c_char; 6usize],
  pub ValidBits: ushort,
  pub tagX640: ::core::ffi::c_uint,
  pub tagX641: ::core::ffi::c_uint,
  pub tagX642: ::core::ffi::c_uint,
  pub tagX643: ::core::ffi::c_uint,
  pub tagX644: ::core::ffi::c_uint,
  pub tagX645: ::core::ffi::c_uint,
  pub tagX646: ::core::ffi::c_uint,
  pub tagX647: ::core::ffi::c_uint,
  pub tagX648: ::core::ffi::c_uint,
  pub tagX649: ::core::ffi::c_uint,
  pub tagX650: ::core::ffi::c_uint,
  pub tagX651: ::core::ffi::c_uint,
  pub tagX652: ::core::ffi::c_uint,
  pub tagX653: ::core::ffi::c_uint,
  pub SensorCalibration: [::core::ffi::c_int; 2usize],
  pub DriveMode: [ushort; 5usize],
  pub ColorSpace: ushort,
  pub FocusMode: [ushort; 2usize],
  pub AutoFocus: ushort,
  pub AFPoint: ushort,
  pub AFAreas: [::core::ffi::c_uint; 64usize],
  pub AFPointSelected: [f64; 5usize],
  pub AFResult: ushort,
  pub AFFineTune: uchar,
  pub AFFineTuneAdj: [::core::ffi::c_short; 3usize],
  pub SpecialMode: [::core::ffi::c_uint; 3usize],
  pub ZoomStepCount: ushort,
  pub FocusStepCount: ushort,
  pub FocusStepInfinity: ushort,
  pub FocusStepNear: ushort,
  pub FocusDistance: f64,
  pub AspectFrame: [ushort; 4usize],
  pub StackedImage: [::core::ffi::c_uint; 2usize],
  pub isLiveND: uchar,
  pub LiveNDfactor: ::core::ffi::c_uint,
  pub Panorama_mode: ushort,
  pub Panorama_frameNum: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_olympus_makernotes_t"]
    [::core::mem::size_of::<libraw_olympus_makernotes_t>() - 464usize];
  ["Alignment of libraw_olympus_makernotes_t"]
    [::core::mem::align_of::<libraw_olympus_makernotes_t>() - 8usize];
  ["Offset of field: libraw_olympus_makernotes_t::CameraType2"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, CameraType2) - 0usize];
  ["Offset of field: libraw_olympus_makernotes_t::ValidBits"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, ValidBits) - 6usize];
  ["Offset of field: libraw_olympus_makernotes_t::tagX640"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, tagX640) - 8usize];
  ["Offset of field: libraw_olympus_makernotes_t::tagX641"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, tagX641) - 12usize];
  ["Offset of field: libraw_olympus_makernotes_t::tagX642"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, tagX642) - 16usize];
  ["Offset of field: libraw_olympus_makernotes_t::tagX643"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, tagX643) - 20usize];
  ["Offset of field: libraw_olympus_makernotes_t::tagX644"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, tagX644) - 24usize];
  ["Offset of field: libraw_olympus_makernotes_t::tagX645"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, tagX645) - 28usize];
  ["Offset of field: libraw_olympus_makernotes_t::tagX646"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, tagX646) - 32usize];
  ["Offset of field: libraw_olympus_makernotes_t::tagX647"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, tagX647) - 36usize];
  ["Offset of field: libraw_olympus_makernotes_t::tagX648"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, tagX648) - 40usize];
  ["Offset of field: libraw_olympus_makernotes_t::tagX649"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, tagX649) - 44usize];
  ["Offset of field: libraw_olympus_makernotes_t::tagX650"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, tagX650) - 48usize];
  ["Offset of field: libraw_olympus_makernotes_t::tagX651"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, tagX651) - 52usize];
  ["Offset of field: libraw_olympus_makernotes_t::tagX652"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, tagX652) - 56usize];
  ["Offset of field: libraw_olympus_makernotes_t::tagX653"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, tagX653) - 60usize];
  ["Offset of field: libraw_olympus_makernotes_t::SensorCalibration"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, SensorCalibration) - 64usize];
  ["Offset of field: libraw_olympus_makernotes_t::DriveMode"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, DriveMode) - 72usize];
  ["Offset of field: libraw_olympus_makernotes_t::ColorSpace"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, ColorSpace) - 82usize];
  ["Offset of field: libraw_olympus_makernotes_t::FocusMode"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, FocusMode) - 84usize];
  ["Offset of field: libraw_olympus_makernotes_t::AutoFocus"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, AutoFocus) - 88usize];
  ["Offset of field: libraw_olympus_makernotes_t::AFPoint"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, AFPoint) - 90usize];
  ["Offset of field: libraw_olympus_makernotes_t::AFAreas"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, AFAreas) - 92usize];
  ["Offset of field: libraw_olympus_makernotes_t::AFPointSelected"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, AFPointSelected) - 352usize];
  ["Offset of field: libraw_olympus_makernotes_t::AFResult"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, AFResult) - 392usize];
  ["Offset of field: libraw_olympus_makernotes_t::AFFineTune"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, AFFineTune) - 394usize];
  ["Offset of field: libraw_olympus_makernotes_t::AFFineTuneAdj"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, AFFineTuneAdj) - 396usize];
  ["Offset of field: libraw_olympus_makernotes_t::SpecialMode"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, SpecialMode) - 404usize];
  ["Offset of field: libraw_olympus_makernotes_t::ZoomStepCount"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, ZoomStepCount) - 416usize];
  ["Offset of field: libraw_olympus_makernotes_t::FocusStepCount"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, FocusStepCount) - 418usize];
  ["Offset of field: libraw_olympus_makernotes_t::FocusStepInfinity"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, FocusStepInfinity) - 420usize];
  ["Offset of field: libraw_olympus_makernotes_t::FocusStepNear"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, FocusStepNear) - 422usize];
  ["Offset of field: libraw_olympus_makernotes_t::FocusDistance"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, FocusDistance) - 424usize];
  ["Offset of field: libraw_olympus_makernotes_t::AspectFrame"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, AspectFrame) - 432usize];
  ["Offset of field: libraw_olympus_makernotes_t::StackedImage"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, StackedImage) - 440usize];
  ["Offset of field: libraw_olympus_makernotes_t::isLiveND"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, isLiveND) - 448usize];
  ["Offset of field: libraw_olympus_makernotes_t::LiveNDfactor"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, LiveNDfactor) - 452usize];
  ["Offset of field: libraw_olympus_makernotes_t::Panorama_mode"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, Panorama_mode) - 456usize];
  ["Offset of field: libraw_olympus_makernotes_t::Panorama_frameNum"]
    [::core::mem::offset_of!(libraw_olympus_makernotes_t, Panorama_frameNum) - 458usize];
};
impl Default for libraw_olympus_makernotes_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_panasonic_makernotes_t {
  pub Compression: ushort,
  pub BlackLevelDim: ushort,
  pub BlackLevel: [f32; 8usize],
  pub Multishot: ::core::ffi::c_uint,
  pub gamma: f32,
  pub HighISOMultiplier: [::core::ffi::c_int; 3usize],
  pub FocusStepNear: ::core::ffi::c_short,
  pub FocusStepCount: ::core::ffi::c_short,
  pub ZoomPosition: ::core::ffi::c_uint,
  pub LensManufacturer: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_panasonic_makernotes_t"]
    [::core::mem::size_of::<libraw_panasonic_makernotes_t>() - 68usize];
  ["Alignment of libraw_panasonic_makernotes_t"]
    [::core::mem::align_of::<libraw_panasonic_makernotes_t>() - 4usize];
  ["Offset of field: libraw_panasonic_makernotes_t::Compression"]
    [::core::mem::offset_of!(libraw_panasonic_makernotes_t, Compression) - 0usize];
  ["Offset of field: libraw_panasonic_makernotes_t::BlackLevelDim"]
    [::core::mem::offset_of!(libraw_panasonic_makernotes_t, BlackLevelDim) - 2usize];
  ["Offset of field: libraw_panasonic_makernotes_t::BlackLevel"]
    [::core::mem::offset_of!(libraw_panasonic_makernotes_t, BlackLevel) - 4usize];
  ["Offset of field: libraw_panasonic_makernotes_t::Multishot"]
    [::core::mem::offset_of!(libraw_panasonic_makernotes_t, Multishot) - 36usize];
  ["Offset of field: libraw_panasonic_makernotes_t::gamma"]
    [::core::mem::offset_of!(libraw_panasonic_makernotes_t, gamma) - 40usize];
  ["Offset of field: libraw_panasonic_makernotes_t::HighISOMultiplier"]
    [::core::mem::offset_of!(libraw_panasonic_makernotes_t, HighISOMultiplier) - 44usize];
  ["Offset of field: libraw_panasonic_makernotes_t::FocusStepNear"]
    [::core::mem::offset_of!(libraw_panasonic_makernotes_t, FocusStepNear) - 56usize];
  ["Offset of field: libraw_panasonic_makernotes_t::FocusStepCount"]
    [::core::mem::offset_of!(libraw_panasonic_makernotes_t, FocusStepCount) - 58usize];
  ["Offset of field: libraw_panasonic_makernotes_t::ZoomPosition"]
    [::core::mem::offset_of!(libraw_panasonic_makernotes_t, ZoomPosition) - 60usize];
  ["Offset of field: libraw_panasonic_makernotes_t::LensManufacturer"]
    [::core::mem::offset_of!(libraw_panasonic_makernotes_t, LensManufacturer) - 64usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_pentax_makernotes_t {
  pub DriveMode: [uchar; 4usize],
  pub FocusMode: [ushort; 2usize],
  pub AFPointSelected: [ushort; 2usize],
  pub AFPointSelected_Area: ushort,
  pub AFPointsInFocus_version: ::core::ffi::c_int,
  pub AFPointsInFocus: ::core::ffi::c_uint,
  pub FocusPosition: ushort,
  pub DynamicRangeExpansion: [uchar; 4usize],
  pub AFAdjustment: ::core::ffi::c_short,
  pub AFPointMode: uchar,
  pub MultiExposure: uchar,
  pub Quality: ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_pentax_makernotes_t"]
    [::core::mem::size_of::<libraw_pentax_makernotes_t>() - 36usize];
  ["Alignment of libraw_pentax_makernotes_t"]
    [::core::mem::align_of::<libraw_pentax_makernotes_t>() - 4usize];
  ["Offset of field: libraw_pentax_makernotes_t::DriveMode"]
    [::core::mem::offset_of!(libraw_pentax_makernotes_t, DriveMode) - 0usize];
  ["Offset of field: libraw_pentax_makernotes_t::FocusMode"]
    [::core::mem::offset_of!(libraw_pentax_makernotes_t, FocusMode) - 4usize];
  ["Offset of field: libraw_pentax_makernotes_t::AFPointSelected"]
    [::core::mem::offset_of!(libraw_pentax_makernotes_t, AFPointSelected) - 8usize];
  ["Offset of field: libraw_pentax_makernotes_t::AFPointSelected_Area"]
    [::core::mem::offset_of!(libraw_pentax_makernotes_t, AFPointSelected_Area) - 12usize];
  ["Offset of field: libraw_pentax_makernotes_t::AFPointsInFocus_version"]
    [::core::mem::offset_of!(libraw_pentax_makernotes_t, AFPointsInFocus_version) - 16usize];
  ["Offset of field: libraw_pentax_makernotes_t::AFPointsInFocus"]
    [::core::mem::offset_of!(libraw_pentax_makernotes_t, AFPointsInFocus) - 20usize];
  ["Offset of field: libraw_pentax_makernotes_t::FocusPosition"]
    [::core::mem::offset_of!(libraw_pentax_makernotes_t, FocusPosition) - 24usize];
  ["Offset of field: libraw_pentax_makernotes_t::DynamicRangeExpansion"]
    [::core::mem::offset_of!(libraw_pentax_makernotes_t, DynamicRangeExpansion) - 26usize];
  ["Offset of field: libraw_pentax_makernotes_t::AFAdjustment"]
    [::core::mem::offset_of!(libraw_pentax_makernotes_t, AFAdjustment) - 30usize];
  ["Offset of field: libraw_pentax_makernotes_t::AFPointMode"]
    [::core::mem::offset_of!(libraw_pentax_makernotes_t, AFPointMode) - 32usize];
  ["Offset of field: libraw_pentax_makernotes_t::MultiExposure"]
    [::core::mem::offset_of!(libraw_pentax_makernotes_t, MultiExposure) - 33usize];
  ["Offset of field: libraw_pentax_makernotes_t::Quality"]
    [::core::mem::offset_of!(libraw_pentax_makernotes_t, Quality) - 34usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_ricoh_makernotes_t {
  pub AFStatus: ushort,
  pub AFAreaXPosition: [::core::ffi::c_uint; 2usize],
  pub AFAreaYPosition: [::core::ffi::c_uint; 2usize],
  pub AFAreaMode: ushort,
  pub SensorWidth: ::core::ffi::c_uint,
  pub SensorHeight: ::core::ffi::c_uint,
  pub CroppedImageWidth: ::core::ffi::c_uint,
  pub CroppedImageHeight: ::core::ffi::c_uint,
  pub WideAdapter: ushort,
  pub CropMode: ushort,
  pub NDFilter: ushort,
  pub AutoBracketing: ushort,
  pub MacroMode: ushort,
  pub FlashMode: ushort,
  pub FlashExposureComp: f64,
  pub ManualFlashOutput: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_ricoh_makernotes_t"]
    [::core::mem::size_of::<libraw_ricoh_makernotes_t>() - 72usize];
  ["Alignment of libraw_ricoh_makernotes_t"]
    [::core::mem::align_of::<libraw_ricoh_makernotes_t>() - 8usize];
  ["Offset of field: libraw_ricoh_makernotes_t::AFStatus"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, AFStatus) - 0usize];
  ["Offset of field: libraw_ricoh_makernotes_t::AFAreaXPosition"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, AFAreaXPosition) - 4usize];
  ["Offset of field: libraw_ricoh_makernotes_t::AFAreaYPosition"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, AFAreaYPosition) - 12usize];
  ["Offset of field: libraw_ricoh_makernotes_t::AFAreaMode"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, AFAreaMode) - 20usize];
  ["Offset of field: libraw_ricoh_makernotes_t::SensorWidth"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, SensorWidth) - 24usize];
  ["Offset of field: libraw_ricoh_makernotes_t::SensorHeight"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, SensorHeight) - 28usize];
  ["Offset of field: libraw_ricoh_makernotes_t::CroppedImageWidth"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, CroppedImageWidth) - 32usize];
  ["Offset of field: libraw_ricoh_makernotes_t::CroppedImageHeight"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, CroppedImageHeight) - 36usize];
  ["Offset of field: libraw_ricoh_makernotes_t::WideAdapter"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, WideAdapter) - 40usize];
  ["Offset of field: libraw_ricoh_makernotes_t::CropMode"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, CropMode) - 42usize];
  ["Offset of field: libraw_ricoh_makernotes_t::NDFilter"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, NDFilter) - 44usize];
  ["Offset of field: libraw_ricoh_makernotes_t::AutoBracketing"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, AutoBracketing) - 46usize];
  ["Offset of field: libraw_ricoh_makernotes_t::MacroMode"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, MacroMode) - 48usize];
  ["Offset of field: libraw_ricoh_makernotes_t::FlashMode"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, FlashMode) - 50usize];
  ["Offset of field: libraw_ricoh_makernotes_t::FlashExposureComp"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, FlashExposureComp) - 56usize];
  ["Offset of field: libraw_ricoh_makernotes_t::ManualFlashOutput"]
    [::core::mem::offset_of!(libraw_ricoh_makernotes_t, ManualFlashOutput) - 64usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_samsung_makernotes_t {
  pub ImageSizeFull: [::core::ffi::c_uint; 4usize],
  pub ImageSizeCrop: [::core::ffi::c_uint; 4usize],
  pub ColorSpace: [::core::ffi::c_int; 2usize],
  pub key: [::core::ffi::c_uint; 11usize],
  pub DigitalGain: f64,
  pub DeviceType: ::core::ffi::c_int,
  pub LensFirmware: [::core::ffi::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_samsung_makernotes_t"]
    [::core::mem::size_of::<libraw_samsung_makernotes_t>() - 136usize];
  ["Alignment of libraw_samsung_makernotes_t"]
    [::core::mem::align_of::<libraw_samsung_makernotes_t>() - 8usize];
  ["Offset of field: libraw_samsung_makernotes_t::ImageSizeFull"]
    [::core::mem::offset_of!(libraw_samsung_makernotes_t, ImageSizeFull) - 0usize];
  ["Offset of field: libraw_samsung_makernotes_t::ImageSizeCrop"]
    [::core::mem::offset_of!(libraw_samsung_makernotes_t, ImageSizeCrop) - 16usize];
  ["Offset of field: libraw_samsung_makernotes_t::ColorSpace"]
    [::core::mem::offset_of!(libraw_samsung_makernotes_t, ColorSpace) - 32usize];
  ["Offset of field: libraw_samsung_makernotes_t::key"]
    [::core::mem::offset_of!(libraw_samsung_makernotes_t, key) - 40usize];
  ["Offset of field: libraw_samsung_makernotes_t::DigitalGain"]
    [::core::mem::offset_of!(libraw_samsung_makernotes_t, DigitalGain) - 88usize];
  ["Offset of field: libraw_samsung_makernotes_t::DeviceType"]
    [::core::mem::offset_of!(libraw_samsung_makernotes_t, DeviceType) - 96usize];
  ["Offset of field: libraw_samsung_makernotes_t::LensFirmware"]
    [::core::mem::offset_of!(libraw_samsung_makernotes_t, LensFirmware) - 100usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_kodak_makernotes_t {
  pub BlackLevelTop: ushort,
  pub BlackLevelBottom: ushort,
  pub offset_left: ::core::ffi::c_short,
  pub offset_top: ::core::ffi::c_short,
  pub clipBlack: ushort,
  pub clipWhite: ushort,
  pub romm_camDaylight: [[f32; 3usize]; 3usize],
  pub romm_camTungsten: [[f32; 3usize]; 3usize],
  pub romm_camFluorescent: [[f32; 3usize]; 3usize],
  pub romm_camFlash: [[f32; 3usize]; 3usize],
  pub romm_camCustom: [[f32; 3usize]; 3usize],
  pub romm_camAuto: [[f32; 3usize]; 3usize],
  pub val018percent: ushort,
  pub val100percent: ushort,
  pub val170percent: ushort,
  pub MakerNoteKodak8a: ::core::ffi::c_short,
  pub ISOCalibrationGain: f32,
  pub AnalogISO: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_kodak_makernotes_t"]
    [::core::mem::size_of::<libraw_kodak_makernotes_t>() - 244usize];
  ["Alignment of libraw_kodak_makernotes_t"]
    [::core::mem::align_of::<libraw_kodak_makernotes_t>() - 4usize];
  ["Offset of field: libraw_kodak_makernotes_t::BlackLevelTop"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, BlackLevelTop) - 0usize];
  ["Offset of field: libraw_kodak_makernotes_t::BlackLevelBottom"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, BlackLevelBottom) - 2usize];
  ["Offset of field: libraw_kodak_makernotes_t::offset_left"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, offset_left) - 4usize];
  ["Offset of field: libraw_kodak_makernotes_t::offset_top"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, offset_top) - 6usize];
  ["Offset of field: libraw_kodak_makernotes_t::clipBlack"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, clipBlack) - 8usize];
  ["Offset of field: libraw_kodak_makernotes_t::clipWhite"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, clipWhite) - 10usize];
  ["Offset of field: libraw_kodak_makernotes_t::romm_camDaylight"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, romm_camDaylight) - 12usize];
  ["Offset of field: libraw_kodak_makernotes_t::romm_camTungsten"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, romm_camTungsten) - 48usize];
  ["Offset of field: libraw_kodak_makernotes_t::romm_camFluorescent"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, romm_camFluorescent) - 84usize];
  ["Offset of field: libraw_kodak_makernotes_t::romm_camFlash"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, romm_camFlash) - 120usize];
  ["Offset of field: libraw_kodak_makernotes_t::romm_camCustom"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, romm_camCustom) - 156usize];
  ["Offset of field: libraw_kodak_makernotes_t::romm_camAuto"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, romm_camAuto) - 192usize];
  ["Offset of field: libraw_kodak_makernotes_t::val018percent"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, val018percent) - 228usize];
  ["Offset of field: libraw_kodak_makernotes_t::val100percent"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, val100percent) - 230usize];
  ["Offset of field: libraw_kodak_makernotes_t::val170percent"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, val170percent) - 232usize];
  ["Offset of field: libraw_kodak_makernotes_t::MakerNoteKodak8a"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, MakerNoteKodak8a) - 234usize];
  ["Offset of field: libraw_kodak_makernotes_t::ISOCalibrationGain"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, ISOCalibrationGain) - 236usize];
  ["Offset of field: libraw_kodak_makernotes_t::AnalogISO"]
    [::core::mem::offset_of!(libraw_kodak_makernotes_t, AnalogISO) - 240usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_p1_makernotes_t {
  pub Software: [::core::ffi::c_char; 64usize],
  pub SystemType: [::core::ffi::c_char; 64usize],
  pub FirmwareString: [::core::ffi::c_char; 256usize],
  pub SystemModel: [::core::ffi::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_p1_makernotes_t"][::core::mem::size_of::<libraw_p1_makernotes_t>() - 448usize];
  ["Alignment of libraw_p1_makernotes_t"]
    [::core::mem::align_of::<libraw_p1_makernotes_t>() - 1usize];
  ["Offset of field: libraw_p1_makernotes_t::Software"]
    [::core::mem::offset_of!(libraw_p1_makernotes_t, Software) - 0usize];
  ["Offset of field: libraw_p1_makernotes_t::SystemType"]
    [::core::mem::offset_of!(libraw_p1_makernotes_t, SystemType) - 64usize];
  ["Offset of field: libraw_p1_makernotes_t::FirmwareString"]
    [::core::mem::offset_of!(libraw_p1_makernotes_t, FirmwareString) - 128usize];
  ["Offset of field: libraw_p1_makernotes_t::SystemModel"]
    [::core::mem::offset_of!(libraw_p1_makernotes_t, SystemModel) - 384usize];
};
impl Default for libraw_p1_makernotes_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_sony_info_t {
  pub CameraType: ushort,
  pub Sony0x9400_version: uchar,
  pub Sony0x9400_ReleaseMode2: uchar,
  pub Sony0x9400_SequenceImageNumber: ::core::ffi::c_uint,
  pub Sony0x9400_SequenceLength1: uchar,
  pub Sony0x9400_SequenceFileNumber: ::core::ffi::c_uint,
  pub Sony0x9400_SequenceLength2: uchar,
  pub AFAreaModeSetting: u8,
  pub AFAreaMode: u16,
  pub FlexibleSpotPosition: [ushort; 2usize],
  pub AFPointSelected: u8,
  pub AFPointSelected_0x201e: u8,
  pub nAFPointsUsed: ::core::ffi::c_short,
  pub AFPointsUsed: [u8; 10usize],
  pub AFTracking: u8,
  pub AFType: u8,
  pub FocusLocation: [ushort; 4usize],
  pub FocusPosition: ushort,
  pub AFMicroAdjValue: i8,
  pub AFMicroAdjOn: i8,
  pub AFMicroAdjRegisteredLenses: uchar,
  pub VariableLowPassFilter: ushort,
  pub LongExposureNoiseReduction: ::core::ffi::c_uint,
  pub HighISONoiseReduction: ushort,
  pub HDR: [ushort; 2usize],
  pub group2010: ushort,
  pub group9050: ushort,
  pub len_group9050: ushort,
  pub real_iso_offset: ushort,
  pub MeteringMode_offset: ushort,
  pub ExposureProgram_offset: ushort,
  pub ReleaseMode2_offset: ushort,
  pub MinoltaCamID: ::core::ffi::c_uint,
  pub firmware: f32,
  pub ImageCount3_offset: ushort,
  pub ImageCount3: ::core::ffi::c_uint,
  pub ElectronicFrontCurtainShutter: ::core::ffi::c_uint,
  pub MeteringMode2: ushort,
  pub SonyDateTime: [::core::ffi::c_char; 20usize],
  pub ShotNumberSincePowerUp: ::core::ffi::c_uint,
  pub PixelShiftGroupPrefix: ushort,
  pub PixelShiftGroupID: ::core::ffi::c_uint,
  pub nShotsInPixelShiftGroup: ::core::ffi::c_char,
  pub numInPixelShiftGroup: ::core::ffi::c_char,
  pub prd_ImageHeight: ushort,
  pub prd_ImageWidth: ushort,
  pub prd_Total_bps: ushort,
  pub prd_Active_bps: ushort,
  pub prd_StorageMethod: ushort,
  pub prd_BayerPattern: ushort,
  pub SonyRawFileType: ushort,
  pub RAWFileType: ushort,
  pub RawSizeType: ushort,
  pub Quality: ::core::ffi::c_uint,
  pub FileFormat: ushort,
  pub MetaVersion: [::core::ffi::c_char; 16usize],
  pub AspectRatio: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_sony_info_t"][::core::mem::size_of::<libraw_sony_info_t>() - 184usize];
  ["Alignment of libraw_sony_info_t"][::core::mem::align_of::<libraw_sony_info_t>() - 4usize];
  ["Offset of field: libraw_sony_info_t::CameraType"]
    [::core::mem::offset_of!(libraw_sony_info_t, CameraType) - 0usize];
  ["Offset of field: libraw_sony_info_t::Sony0x9400_version"]
    [::core::mem::offset_of!(libraw_sony_info_t, Sony0x9400_version) - 2usize];
  ["Offset of field: libraw_sony_info_t::Sony0x9400_ReleaseMode2"]
    [::core::mem::offset_of!(libraw_sony_info_t, Sony0x9400_ReleaseMode2) - 3usize];
  ["Offset of field: libraw_sony_info_t::Sony0x9400_SequenceImageNumber"]
    [::core::mem::offset_of!(libraw_sony_info_t, Sony0x9400_SequenceImageNumber) - 4usize];
  ["Offset of field: libraw_sony_info_t::Sony0x9400_SequenceLength1"]
    [::core::mem::offset_of!(libraw_sony_info_t, Sony0x9400_SequenceLength1) - 8usize];
  ["Offset of field: libraw_sony_info_t::Sony0x9400_SequenceFileNumber"]
    [::core::mem::offset_of!(libraw_sony_info_t, Sony0x9400_SequenceFileNumber) - 12usize];
  ["Offset of field: libraw_sony_info_t::Sony0x9400_SequenceLength2"]
    [::core::mem::offset_of!(libraw_sony_info_t, Sony0x9400_SequenceLength2) - 16usize];
  ["Offset of field: libraw_sony_info_t::AFAreaModeSetting"]
    [::core::mem::offset_of!(libraw_sony_info_t, AFAreaModeSetting) - 17usize];
  ["Offset of field: libraw_sony_info_t::AFAreaMode"]
    [::core::mem::offset_of!(libraw_sony_info_t, AFAreaMode) - 18usize];
  ["Offset of field: libraw_sony_info_t::FlexibleSpotPosition"]
    [::core::mem::offset_of!(libraw_sony_info_t, FlexibleSpotPosition) - 20usize];
  ["Offset of field: libraw_sony_info_t::AFPointSelected"]
    [::core::mem::offset_of!(libraw_sony_info_t, AFPointSelected) - 24usize];
  ["Offset of field: libraw_sony_info_t::AFPointSelected_0x201e"]
    [::core::mem::offset_of!(libraw_sony_info_t, AFPointSelected_0x201e) - 25usize];
  ["Offset of field: libraw_sony_info_t::nAFPointsUsed"]
    [::core::mem::offset_of!(libraw_sony_info_t, nAFPointsUsed) - 26usize];
  ["Offset of field: libraw_sony_info_t::AFPointsUsed"]
    [::core::mem::offset_of!(libraw_sony_info_t, AFPointsUsed) - 28usize];
  ["Offset of field: libraw_sony_info_t::AFTracking"]
    [::core::mem::offset_of!(libraw_sony_info_t, AFTracking) - 38usize];
  ["Offset of field: libraw_sony_info_t::AFType"]
    [::core::mem::offset_of!(libraw_sony_info_t, AFType) - 39usize];
  ["Offset of field: libraw_sony_info_t::FocusLocation"]
    [::core::mem::offset_of!(libraw_sony_info_t, FocusLocation) - 40usize];
  ["Offset of field: libraw_sony_info_t::FocusPosition"]
    [::core::mem::offset_of!(libraw_sony_info_t, FocusPosition) - 48usize];
  ["Offset of field: libraw_sony_info_t::AFMicroAdjValue"]
    [::core::mem::offset_of!(libraw_sony_info_t, AFMicroAdjValue) - 50usize];
  ["Offset of field: libraw_sony_info_t::AFMicroAdjOn"]
    [::core::mem::offset_of!(libraw_sony_info_t, AFMicroAdjOn) - 51usize];
  ["Offset of field: libraw_sony_info_t::AFMicroAdjRegisteredLenses"]
    [::core::mem::offset_of!(libraw_sony_info_t, AFMicroAdjRegisteredLenses) - 52usize];
  ["Offset of field: libraw_sony_info_t::VariableLowPassFilter"]
    [::core::mem::offset_of!(libraw_sony_info_t, VariableLowPassFilter) - 54usize];
  ["Offset of field: libraw_sony_info_t::LongExposureNoiseReduction"]
    [::core::mem::offset_of!(libraw_sony_info_t, LongExposureNoiseReduction) - 56usize];
  ["Offset of field: libraw_sony_info_t::HighISONoiseReduction"]
    [::core::mem::offset_of!(libraw_sony_info_t, HighISONoiseReduction) - 60usize];
  ["Offset of field: libraw_sony_info_t::HDR"]
    [::core::mem::offset_of!(libraw_sony_info_t, HDR) - 62usize];
  ["Offset of field: libraw_sony_info_t::group2010"]
    [::core::mem::offset_of!(libraw_sony_info_t, group2010) - 66usize];
  ["Offset of field: libraw_sony_info_t::group9050"]
    [::core::mem::offset_of!(libraw_sony_info_t, group9050) - 68usize];
  ["Offset of field: libraw_sony_info_t::len_group9050"]
    [::core::mem::offset_of!(libraw_sony_info_t, len_group9050) - 70usize];
  ["Offset of field: libraw_sony_info_t::real_iso_offset"]
    [::core::mem::offset_of!(libraw_sony_info_t, real_iso_offset) - 72usize];
  ["Offset of field: libraw_sony_info_t::MeteringMode_offset"]
    [::core::mem::offset_of!(libraw_sony_info_t, MeteringMode_offset) - 74usize];
  ["Offset of field: libraw_sony_info_t::ExposureProgram_offset"]
    [::core::mem::offset_of!(libraw_sony_info_t, ExposureProgram_offset) - 76usize];
  ["Offset of field: libraw_sony_info_t::ReleaseMode2_offset"]
    [::core::mem::offset_of!(libraw_sony_info_t, ReleaseMode2_offset) - 78usize];
  ["Offset of field: libraw_sony_info_t::MinoltaCamID"]
    [::core::mem::offset_of!(libraw_sony_info_t, MinoltaCamID) - 80usize];
  ["Offset of field: libraw_sony_info_t::firmware"]
    [::core::mem::offset_of!(libraw_sony_info_t, firmware) - 84usize];
  ["Offset of field: libraw_sony_info_t::ImageCount3_offset"]
    [::core::mem::offset_of!(libraw_sony_info_t, ImageCount3_offset) - 88usize];
  ["Offset of field: libraw_sony_info_t::ImageCount3"]
    [::core::mem::offset_of!(libraw_sony_info_t, ImageCount3) - 92usize];
  ["Offset of field: libraw_sony_info_t::ElectronicFrontCurtainShutter"]
    [::core::mem::offset_of!(libraw_sony_info_t, ElectronicFrontCurtainShutter) - 96usize];
  ["Offset of field: libraw_sony_info_t::MeteringMode2"]
    [::core::mem::offset_of!(libraw_sony_info_t, MeteringMode2) - 100usize];
  ["Offset of field: libraw_sony_info_t::SonyDateTime"]
    [::core::mem::offset_of!(libraw_sony_info_t, SonyDateTime) - 102usize];
  ["Offset of field: libraw_sony_info_t::ShotNumberSincePowerUp"]
    [::core::mem::offset_of!(libraw_sony_info_t, ShotNumberSincePowerUp) - 124usize];
  ["Offset of field: libraw_sony_info_t::PixelShiftGroupPrefix"]
    [::core::mem::offset_of!(libraw_sony_info_t, PixelShiftGroupPrefix) - 128usize];
  ["Offset of field: libraw_sony_info_t::PixelShiftGroupID"]
    [::core::mem::offset_of!(libraw_sony_info_t, PixelShiftGroupID) - 132usize];
  ["Offset of field: libraw_sony_info_t::nShotsInPixelShiftGroup"]
    [::core::mem::offset_of!(libraw_sony_info_t, nShotsInPixelShiftGroup) - 136usize];
  ["Offset of field: libraw_sony_info_t::numInPixelShiftGroup"]
    [::core::mem::offset_of!(libraw_sony_info_t, numInPixelShiftGroup) - 137usize];
  ["Offset of field: libraw_sony_info_t::prd_ImageHeight"]
    [::core::mem::offset_of!(libraw_sony_info_t, prd_ImageHeight) - 138usize];
  ["Offset of field: libraw_sony_info_t::prd_ImageWidth"]
    [::core::mem::offset_of!(libraw_sony_info_t, prd_ImageWidth) - 140usize];
  ["Offset of field: libraw_sony_info_t::prd_Total_bps"]
    [::core::mem::offset_of!(libraw_sony_info_t, prd_Total_bps) - 142usize];
  ["Offset of field: libraw_sony_info_t::prd_Active_bps"]
    [::core::mem::offset_of!(libraw_sony_info_t, prd_Active_bps) - 144usize];
  ["Offset of field: libraw_sony_info_t::prd_StorageMethod"]
    [::core::mem::offset_of!(libraw_sony_info_t, prd_StorageMethod) - 146usize];
  ["Offset of field: libraw_sony_info_t::prd_BayerPattern"]
    [::core::mem::offset_of!(libraw_sony_info_t, prd_BayerPattern) - 148usize];
  ["Offset of field: libraw_sony_info_t::SonyRawFileType"]
    [::core::mem::offset_of!(libraw_sony_info_t, SonyRawFileType) - 150usize];
  ["Offset of field: libraw_sony_info_t::RAWFileType"]
    [::core::mem::offset_of!(libraw_sony_info_t, RAWFileType) - 152usize];
  ["Offset of field: libraw_sony_info_t::RawSizeType"]
    [::core::mem::offset_of!(libraw_sony_info_t, RawSizeType) - 154usize];
  ["Offset of field: libraw_sony_info_t::Quality"]
    [::core::mem::offset_of!(libraw_sony_info_t, Quality) - 156usize];
  ["Offset of field: libraw_sony_info_t::FileFormat"]
    [::core::mem::offset_of!(libraw_sony_info_t, FileFormat) - 160usize];
  ["Offset of field: libraw_sony_info_t::MetaVersion"]
    [::core::mem::offset_of!(libraw_sony_info_t, MetaVersion) - 162usize];
  ["Offset of field: libraw_sony_info_t::AspectRatio"]
    [::core::mem::offset_of!(libraw_sony_info_t, AspectRatio) - 180usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_colordata_t {
  pub curve: [ushort; 65536usize],
  pub cblack: [::core::ffi::c_uint; 4104usize],
  pub black: ::core::ffi::c_uint,
  pub data_maximum: ::core::ffi::c_uint,
  pub maximum: ::core::ffi::c_uint,
  pub linear_max: [::core::ffi::c_uint; 4usize],
  pub fmaximum: f32,
  pub fnorm: f32,
  pub white: [[ushort; 8usize]; 8usize],
  pub cam_mul: [f32; 4usize],
  pub pre_mul: [f32; 4usize],
  pub cmatrix: [[f32; 4usize]; 3usize],
  pub ccm: [[f32; 4usize]; 3usize],
  pub rgb_cam: [[f32; 4usize]; 3usize],
  pub cam_xyz: [[f32; 3usize]; 4usize],
  pub phase_one_data: ph1_t,
  pub flash_used: f32,
  pub canon_ev: f32,
  pub model2: [::core::ffi::c_char; 64usize],
  pub UniqueCameraModel: [::core::ffi::c_char; 64usize],
  pub LocalizedCameraModel: [::core::ffi::c_char; 64usize],
  pub ImageUniqueID: [::core::ffi::c_char; 64usize],
  pub RawDataUniqueID: [::core::ffi::c_char; 17usize],
  pub OriginalRawFileName: [::core::ffi::c_char; 64usize],
  pub profile: *mut ::core::ffi::c_void,
  pub profile_length: ::core::ffi::c_uint,
  pub black_stat: [::core::ffi::c_uint; 8usize],
  pub dng_color: [libraw_dng_color_t; 2usize],
  pub dng_levels: libraw_dng_levels_t,
  pub WB_Coeffs: [[::core::ffi::c_int; 4usize]; 256usize],
  pub WBCT_Coeffs: [[f32; 5usize]; 64usize],
  pub as_shot_wb_applied: ::core::ffi::c_int,
  pub P1_color: [libraw_P1_color_t; 2usize],
  pub raw_bps: ::core::ffi::c_uint,
  pub ExifColorSpace: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_colordata_t"][::core::mem::size_of::<libraw_colordata_t>() - 187088usize];
  ["Alignment of libraw_colordata_t"][::core::mem::align_of::<libraw_colordata_t>() - 8usize];
  ["Offset of field: libraw_colordata_t::curve"]
    [::core::mem::offset_of!(libraw_colordata_t, curve) - 0usize];
  ["Offset of field: libraw_colordata_t::cblack"]
    [::core::mem::offset_of!(libraw_colordata_t, cblack) - 131072usize];
  ["Offset of field: libraw_colordata_t::black"]
    [::core::mem::offset_of!(libraw_colordata_t, black) - 147488usize];
  ["Offset of field: libraw_colordata_t::data_maximum"]
    [::core::mem::offset_of!(libraw_colordata_t, data_maximum) - 147492usize];
  ["Offset of field: libraw_colordata_t::maximum"]
    [::core::mem::offset_of!(libraw_colordata_t, maximum) - 147496usize];
  ["Offset of field: libraw_colordata_t::linear_max"]
    [::core::mem::offset_of!(libraw_colordata_t, linear_max) - 147500usize];
  ["Offset of field: libraw_colordata_t::fmaximum"]
    [::core::mem::offset_of!(libraw_colordata_t, fmaximum) - 147516usize];
  ["Offset of field: libraw_colordata_t::fnorm"]
    [::core::mem::offset_of!(libraw_colordata_t, fnorm) - 147520usize];
  ["Offset of field: libraw_colordata_t::white"]
    [::core::mem::offset_of!(libraw_colordata_t, white) - 147524usize];
  ["Offset of field: libraw_colordata_t::cam_mul"]
    [::core::mem::offset_of!(libraw_colordata_t, cam_mul) - 147652usize];
  ["Offset of field: libraw_colordata_t::pre_mul"]
    [::core::mem::offset_of!(libraw_colordata_t, pre_mul) - 147668usize];
  ["Offset of field: libraw_colordata_t::cmatrix"]
    [::core::mem::offset_of!(libraw_colordata_t, cmatrix) - 147684usize];
  ["Offset of field: libraw_colordata_t::ccm"]
    [::core::mem::offset_of!(libraw_colordata_t, ccm) - 147732usize];
  ["Offset of field: libraw_colordata_t::rgb_cam"]
    [::core::mem::offset_of!(libraw_colordata_t, rgb_cam) - 147780usize];
  ["Offset of field: libraw_colordata_t::cam_xyz"]
    [::core::mem::offset_of!(libraw_colordata_t, cam_xyz) - 147828usize];
  ["Offset of field: libraw_colordata_t::phase_one_data"]
    [::core::mem::offset_of!(libraw_colordata_t, phase_one_data) - 147876usize];
  ["Offset of field: libraw_colordata_t::flash_used"]
    [::core::mem::offset_of!(libraw_colordata_t, flash_used) - 147912usize];
  ["Offset of field: libraw_colordata_t::canon_ev"]
    [::core::mem::offset_of!(libraw_colordata_t, canon_ev) - 147916usize];
  ["Offset of field: libraw_colordata_t::model2"]
    [::core::mem::offset_of!(libraw_colordata_t, model2) - 147920usize];
  ["Offset of field: libraw_colordata_t::UniqueCameraModel"]
    [::core::mem::offset_of!(libraw_colordata_t, UniqueCameraModel) - 147984usize];
  ["Offset of field: libraw_colordata_t::LocalizedCameraModel"]
    [::core::mem::offset_of!(libraw_colordata_t, LocalizedCameraModel) - 148048usize];
  ["Offset of field: libraw_colordata_t::ImageUniqueID"]
    [::core::mem::offset_of!(libraw_colordata_t, ImageUniqueID) - 148112usize];
  ["Offset of field: libraw_colordata_t::RawDataUniqueID"]
    [::core::mem::offset_of!(libraw_colordata_t, RawDataUniqueID) - 148176usize];
  ["Offset of field: libraw_colordata_t::OriginalRawFileName"]
    [::core::mem::offset_of!(libraw_colordata_t, OriginalRawFileName) - 148193usize];
  ["Offset of field: libraw_colordata_t::profile"]
    [::core::mem::offset_of!(libraw_colordata_t, profile) - 148264usize];
  ["Offset of field: libraw_colordata_t::profile_length"]
    [::core::mem::offset_of!(libraw_colordata_t, profile_length) - 148272usize];
  ["Offset of field: libraw_colordata_t::black_stat"]
    [::core::mem::offset_of!(libraw_colordata_t, black_stat) - 148276usize];
  ["Offset of field: libraw_colordata_t::dng_color"]
    [::core::mem::offset_of!(libraw_colordata_t, dng_color) - 148308usize];
  ["Offset of field: libraw_colordata_t::dng_levels"]
    [::core::mem::offset_of!(libraw_colordata_t, dng_levels) - 148648usize];
  ["Offset of field: libraw_colordata_t::WB_Coeffs"]
    [::core::mem::offset_of!(libraw_colordata_t, WB_Coeffs) - 181624usize];
  ["Offset of field: libraw_colordata_t::WBCT_Coeffs"]
    [::core::mem::offset_of!(libraw_colordata_t, WBCT_Coeffs) - 185720usize];
  ["Offset of field: libraw_colordata_t::as_shot_wb_applied"]
    [::core::mem::offset_of!(libraw_colordata_t, as_shot_wb_applied) - 187000usize];
  ["Offset of field: libraw_colordata_t::P1_color"]
    [::core::mem::offset_of!(libraw_colordata_t, P1_color) - 187004usize];
  ["Offset of field: libraw_colordata_t::raw_bps"]
    [::core::mem::offset_of!(libraw_colordata_t, raw_bps) - 187076usize];
  ["Offset of field: libraw_colordata_t::ExifColorSpace"]
    [::core::mem::offset_of!(libraw_colordata_t, ExifColorSpace) - 187080usize];
};
impl Default for libraw_colordata_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_thumbnail_t {
  pub tformat: LibRaw_thumbnail_formats,
  pub twidth: ushort,
  pub theight: ushort,
  pub tlength: ::core::ffi::c_uint,
  pub tcolors: ::core::ffi::c_int,
  pub thumb: *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_thumbnail_t"][::core::mem::size_of::<libraw_thumbnail_t>() - 24usize];
  ["Alignment of libraw_thumbnail_t"][::core::mem::align_of::<libraw_thumbnail_t>() - 8usize];
  ["Offset of field: libraw_thumbnail_t::tformat"]
    [::core::mem::offset_of!(libraw_thumbnail_t, tformat) - 0usize];
  ["Offset of field: libraw_thumbnail_t::twidth"]
    [::core::mem::offset_of!(libraw_thumbnail_t, twidth) - 4usize];
  ["Offset of field: libraw_thumbnail_t::theight"]
    [::core::mem::offset_of!(libraw_thumbnail_t, theight) - 6usize];
  ["Offset of field: libraw_thumbnail_t::tlength"]
    [::core::mem::offset_of!(libraw_thumbnail_t, tlength) - 8usize];
  ["Offset of field: libraw_thumbnail_t::tcolors"]
    [::core::mem::offset_of!(libraw_thumbnail_t, tcolors) - 12usize];
  ["Offset of field: libraw_thumbnail_t::thumb"]
    [::core::mem::offset_of!(libraw_thumbnail_t, thumb) - 16usize];
};
impl Default for libraw_thumbnail_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_thumbnail_item_t {
  pub tformat: LibRaw_internal_thumbnail_formats,
  pub twidth: ushort,
  pub theight: ushort,
  pub tflip: ushort,
  pub tlength: ::core::ffi::c_uint,
  pub tmisc: ::core::ffi::c_uint,
  pub toffset: INT64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_thumbnail_item_t"][::core::mem::size_of::<libraw_thumbnail_item_t>() - 32usize];
  ["Alignment of libraw_thumbnail_item_t"]
    [::core::mem::align_of::<libraw_thumbnail_item_t>() - 8usize];
  ["Offset of field: libraw_thumbnail_item_t::tformat"]
    [::core::mem::offset_of!(libraw_thumbnail_item_t, tformat) - 0usize];
  ["Offset of field: libraw_thumbnail_item_t::twidth"]
    [::core::mem::offset_of!(libraw_thumbnail_item_t, twidth) - 4usize];
  ["Offset of field: libraw_thumbnail_item_t::theight"]
    [::core::mem::offset_of!(libraw_thumbnail_item_t, theight) - 6usize];
  ["Offset of field: libraw_thumbnail_item_t::tflip"]
    [::core::mem::offset_of!(libraw_thumbnail_item_t, tflip) - 8usize];
  ["Offset of field: libraw_thumbnail_item_t::tlength"]
    [::core::mem::offset_of!(libraw_thumbnail_item_t, tlength) - 12usize];
  ["Offset of field: libraw_thumbnail_item_t::tmisc"]
    [::core::mem::offset_of!(libraw_thumbnail_item_t, tmisc) - 16usize];
  ["Offset of field: libraw_thumbnail_item_t::toffset"]
    [::core::mem::offset_of!(libraw_thumbnail_item_t, toffset) - 24usize];
};
impl Default for libraw_thumbnail_item_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_thumbnail_list_t {
  pub thumbcount: ::core::ffi::c_int,
  pub thumblist: [libraw_thumbnail_item_t; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_thumbnail_list_t"][::core::mem::size_of::<libraw_thumbnail_list_t>() - 264usize];
  ["Alignment of libraw_thumbnail_list_t"]
    [::core::mem::align_of::<libraw_thumbnail_list_t>() - 8usize];
  ["Offset of field: libraw_thumbnail_list_t::thumbcount"]
    [::core::mem::offset_of!(libraw_thumbnail_list_t, thumbcount) - 0usize];
  ["Offset of field: libraw_thumbnail_list_t::thumblist"]
    [::core::mem::offset_of!(libraw_thumbnail_list_t, thumblist) - 8usize];
};
impl Default for libraw_thumbnail_list_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_gps_info_t {
  pub latitude: [f32; 3usize],
  pub longitude: [f32; 3usize],
  pub gpstimestamp: [f32; 3usize],
  pub altitude: f32,
  pub altref: ::core::ffi::c_char,
  pub latref: ::core::ffi::c_char,
  pub longref: ::core::ffi::c_char,
  pub gpsstatus: ::core::ffi::c_char,
  pub gpsparsed: ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_gps_info_t"][::core::mem::size_of::<libraw_gps_info_t>() - 48usize];
  ["Alignment of libraw_gps_info_t"][::core::mem::align_of::<libraw_gps_info_t>() - 4usize];
  ["Offset of field: libraw_gps_info_t::latitude"]
    [::core::mem::offset_of!(libraw_gps_info_t, latitude) - 0usize];
  ["Offset of field: libraw_gps_info_t::longitude"]
    [::core::mem::offset_of!(libraw_gps_info_t, longitude) - 12usize];
  ["Offset of field: libraw_gps_info_t::gpstimestamp"]
    [::core::mem::offset_of!(libraw_gps_info_t, gpstimestamp) - 24usize];
  ["Offset of field: libraw_gps_info_t::altitude"]
    [::core::mem::offset_of!(libraw_gps_info_t, altitude) - 36usize];
  ["Offset of field: libraw_gps_info_t::altref"]
    [::core::mem::offset_of!(libraw_gps_info_t, altref) - 40usize];
  ["Offset of field: libraw_gps_info_t::latref"]
    [::core::mem::offset_of!(libraw_gps_info_t, latref) - 41usize];
  ["Offset of field: libraw_gps_info_t::longref"]
    [::core::mem::offset_of!(libraw_gps_info_t, longref) - 42usize];
  ["Offset of field: libraw_gps_info_t::gpsstatus"]
    [::core::mem::offset_of!(libraw_gps_info_t, gpsstatus) - 43usize];
  ["Offset of field: libraw_gps_info_t::gpsparsed"]
    [::core::mem::offset_of!(libraw_gps_info_t, gpsparsed) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_imgother_t {
  pub iso_speed: f32,
  pub shutter: f32,
  pub aperture: f32,
  pub focal_len: f32,
  pub timestamp: time_t,
  pub shot_order: ::core::ffi::c_uint,
  pub gpsdata: [::core::ffi::c_uint; 32usize],
  pub parsed_gps: libraw_gps_info_t,
  pub desc: [::core::ffi::c_char; 512usize],
  pub artist: [::core::ffi::c_char; 64usize],
  pub analogbalance: [f32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_imgother_t"][::core::mem::size_of::<libraw_imgother_t>() - 800usize];
  ["Alignment of libraw_imgother_t"][::core::mem::align_of::<libraw_imgother_t>() - 8usize];
  ["Offset of field: libraw_imgother_t::iso_speed"]
    [::core::mem::offset_of!(libraw_imgother_t, iso_speed) - 0usize];
  ["Offset of field: libraw_imgother_t::shutter"]
    [::core::mem::offset_of!(libraw_imgother_t, shutter) - 4usize];
  ["Offset of field: libraw_imgother_t::aperture"]
    [::core::mem::offset_of!(libraw_imgother_t, aperture) - 8usize];
  ["Offset of field: libraw_imgother_t::focal_len"]
    [::core::mem::offset_of!(libraw_imgother_t, focal_len) - 12usize];
  ["Offset of field: libraw_imgother_t::timestamp"]
    [::core::mem::offset_of!(libraw_imgother_t, timestamp) - 16usize];
  ["Offset of field: libraw_imgother_t::shot_order"]
    [::core::mem::offset_of!(libraw_imgother_t, shot_order) - 24usize];
  ["Offset of field: libraw_imgother_t::gpsdata"]
    [::core::mem::offset_of!(libraw_imgother_t, gpsdata) - 28usize];
  ["Offset of field: libraw_imgother_t::parsed_gps"]
    [::core::mem::offset_of!(libraw_imgother_t, parsed_gps) - 156usize];
  ["Offset of field: libraw_imgother_t::desc"]
    [::core::mem::offset_of!(libraw_imgother_t, desc) - 204usize];
  ["Offset of field: libraw_imgother_t::artist"]
    [::core::mem::offset_of!(libraw_imgother_t, artist) - 716usize];
  ["Offset of field: libraw_imgother_t::analogbalance"]
    [::core::mem::offset_of!(libraw_imgother_t, analogbalance) - 780usize];
};
impl Default for libraw_imgother_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_afinfo_item_t {
  pub AFInfoData_tag: ::core::ffi::c_uint,
  pub AFInfoData_order: ::core::ffi::c_short,
  pub AFInfoData_version: ::core::ffi::c_uint,
  pub AFInfoData_length: ::core::ffi::c_uint,
  pub AFInfoData: *mut uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_afinfo_item_t"][::core::mem::size_of::<libraw_afinfo_item_t>() - 24usize];
  ["Alignment of libraw_afinfo_item_t"][::core::mem::align_of::<libraw_afinfo_item_t>() - 8usize];
  ["Offset of field: libraw_afinfo_item_t::AFInfoData_tag"]
    [::core::mem::offset_of!(libraw_afinfo_item_t, AFInfoData_tag) - 0usize];
  ["Offset of field: libraw_afinfo_item_t::AFInfoData_order"]
    [::core::mem::offset_of!(libraw_afinfo_item_t, AFInfoData_order) - 4usize];
  ["Offset of field: libraw_afinfo_item_t::AFInfoData_version"]
    [::core::mem::offset_of!(libraw_afinfo_item_t, AFInfoData_version) - 8usize];
  ["Offset of field: libraw_afinfo_item_t::AFInfoData_length"]
    [::core::mem::offset_of!(libraw_afinfo_item_t, AFInfoData_length) - 12usize];
  ["Offset of field: libraw_afinfo_item_t::AFInfoData"]
    [::core::mem::offset_of!(libraw_afinfo_item_t, AFInfoData) - 16usize];
};
impl Default for libraw_afinfo_item_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_metadata_common_t {
  pub FlashEC: f32,
  pub FlashGN: f32,
  pub CameraTemperature: f32,
  pub SensorTemperature: f32,
  pub SensorTemperature2: f32,
  pub LensTemperature: f32,
  pub AmbientTemperature: f32,
  pub BatteryTemperature: f32,
  pub exifAmbientTemperature: f32,
  pub exifHumidity: f32,
  pub exifPressure: f32,
  pub exifWaterDepth: f32,
  pub exifAcceleration: f32,
  pub exifCameraElevationAngle: f32,
  pub real_ISO: f32,
  pub exifExposureIndex: f32,
  pub ColorSpace: ushort,
  pub firmware: [::core::ffi::c_char; 128usize],
  pub ExposureCalibrationShift: f32,
  pub afdata: [libraw_afinfo_item_t; 4usize],
  pub afcount: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_metadata_common_t"]
    [::core::mem::size_of::<libraw_metadata_common_t>() - 304usize];
  ["Alignment of libraw_metadata_common_t"]
    [::core::mem::align_of::<libraw_metadata_common_t>() - 8usize];
  ["Offset of field: libraw_metadata_common_t::FlashEC"]
    [::core::mem::offset_of!(libraw_metadata_common_t, FlashEC) - 0usize];
  ["Offset of field: libraw_metadata_common_t::FlashGN"]
    [::core::mem::offset_of!(libraw_metadata_common_t, FlashGN) - 4usize];
  ["Offset of field: libraw_metadata_common_t::CameraTemperature"]
    [::core::mem::offset_of!(libraw_metadata_common_t, CameraTemperature) - 8usize];
  ["Offset of field: libraw_metadata_common_t::SensorTemperature"]
    [::core::mem::offset_of!(libraw_metadata_common_t, SensorTemperature) - 12usize];
  ["Offset of field: libraw_metadata_common_t::SensorTemperature2"]
    [::core::mem::offset_of!(libraw_metadata_common_t, SensorTemperature2) - 16usize];
  ["Offset of field: libraw_metadata_common_t::LensTemperature"]
    [::core::mem::offset_of!(libraw_metadata_common_t, LensTemperature) - 20usize];
  ["Offset of field: libraw_metadata_common_t::AmbientTemperature"]
    [::core::mem::offset_of!(libraw_metadata_common_t, AmbientTemperature) - 24usize];
  ["Offset of field: libraw_metadata_common_t::BatteryTemperature"]
    [::core::mem::offset_of!(libraw_metadata_common_t, BatteryTemperature) - 28usize];
  ["Offset of field: libraw_metadata_common_t::exifAmbientTemperature"]
    [::core::mem::offset_of!(libraw_metadata_common_t, exifAmbientTemperature) - 32usize];
  ["Offset of field: libraw_metadata_common_t::exifHumidity"]
    [::core::mem::offset_of!(libraw_metadata_common_t, exifHumidity) - 36usize];
  ["Offset of field: libraw_metadata_common_t::exifPressure"]
    [::core::mem::offset_of!(libraw_metadata_common_t, exifPressure) - 40usize];
  ["Offset of field: libraw_metadata_common_t::exifWaterDepth"]
    [::core::mem::offset_of!(libraw_metadata_common_t, exifWaterDepth) - 44usize];
  ["Offset of field: libraw_metadata_common_t::exifAcceleration"]
    [::core::mem::offset_of!(libraw_metadata_common_t, exifAcceleration) - 48usize];
  ["Offset of field: libraw_metadata_common_t::exifCameraElevationAngle"]
    [::core::mem::offset_of!(libraw_metadata_common_t, exifCameraElevationAngle) - 52usize];
  ["Offset of field: libraw_metadata_common_t::real_ISO"]
    [::core::mem::offset_of!(libraw_metadata_common_t, real_ISO) - 56usize];
  ["Offset of field: libraw_metadata_common_t::exifExposureIndex"]
    [::core::mem::offset_of!(libraw_metadata_common_t, exifExposureIndex) - 60usize];
  ["Offset of field: libraw_metadata_common_t::ColorSpace"]
    [::core::mem::offset_of!(libraw_metadata_common_t, ColorSpace) - 64usize];
  ["Offset of field: libraw_metadata_common_t::firmware"]
    [::core::mem::offset_of!(libraw_metadata_common_t, firmware) - 66usize];
  ["Offset of field: libraw_metadata_common_t::ExposureCalibrationShift"]
    [::core::mem::offset_of!(libraw_metadata_common_t, ExposureCalibrationShift) - 196usize];
  ["Offset of field: libraw_metadata_common_t::afdata"]
    [::core::mem::offset_of!(libraw_metadata_common_t, afdata) - 200usize];
  ["Offset of field: libraw_metadata_common_t::afcount"]
    [::core::mem::offset_of!(libraw_metadata_common_t, afcount) - 296usize];
};
impl Default for libraw_metadata_common_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_output_params_t {
  pub greybox: [::core::ffi::c_uint; 4usize],
  pub cropbox: [::core::ffi::c_uint; 4usize],
  pub aber: [f64; 4usize],
  pub gamm: [f64; 6usize],
  pub user_mul: [f32; 4usize],
  pub bright: f32,
  pub threshold: f32,
  pub half_size: ::core::ffi::c_int,
  pub four_color_rgb: ::core::ffi::c_int,
  pub highlight: ::core::ffi::c_int,
  pub use_auto_wb: ::core::ffi::c_int,
  pub use_camera_wb: ::core::ffi::c_int,
  pub use_camera_matrix: ::core::ffi::c_int,
  pub output_color: ::core::ffi::c_int,
  pub output_profile: *mut ::core::ffi::c_char,
  pub camera_profile: *mut ::core::ffi::c_char,
  pub bad_pixels: *mut ::core::ffi::c_char,
  pub dark_frame: *mut ::core::ffi::c_char,
  pub output_bps: ::core::ffi::c_int,
  pub output_tiff: ::core::ffi::c_int,
  pub output_flags: ::core::ffi::c_int,
  pub user_flip: ::core::ffi::c_int,
  pub user_qual: ::core::ffi::c_int,
  pub user_black: ::core::ffi::c_int,
  pub user_cblack: [::core::ffi::c_int; 4usize],
  pub user_sat: ::core::ffi::c_int,
  pub med_passes: ::core::ffi::c_int,
  pub auto_bright_thr: f32,
  pub adjust_maximum_thr: f32,
  pub no_auto_bright: ::core::ffi::c_int,
  pub use_fuji_rotate: ::core::ffi::c_int,
  pub use_p1_correction: ::core::ffi::c_int,
  pub green_matching: ::core::ffi::c_int,
  pub dcb_iterations: ::core::ffi::c_int,
  pub dcb_enhance_fl: ::core::ffi::c_int,
  pub fbdd_noiserd: ::core::ffi::c_int,
  pub exp_correc: ::core::ffi::c_int,
  pub exp_shift: f32,
  pub exp_preser: f32,
  pub no_auto_scale: ::core::ffi::c_int,
  pub no_interpolation: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_output_params_t"][::core::mem::size_of::<libraw_output_params_t>() - 304usize];
  ["Alignment of libraw_output_params_t"]
    [::core::mem::align_of::<libraw_output_params_t>() - 8usize];
  ["Offset of field: libraw_output_params_t::greybox"]
    [::core::mem::offset_of!(libraw_output_params_t, greybox) - 0usize];
  ["Offset of field: libraw_output_params_t::cropbox"]
    [::core::mem::offset_of!(libraw_output_params_t, cropbox) - 16usize];
  ["Offset of field: libraw_output_params_t::aber"]
    [::core::mem::offset_of!(libraw_output_params_t, aber) - 32usize];
  ["Offset of field: libraw_output_params_t::gamm"]
    [::core::mem::offset_of!(libraw_output_params_t, gamm) - 64usize];
  ["Offset of field: libraw_output_params_t::user_mul"]
    [::core::mem::offset_of!(libraw_output_params_t, user_mul) - 112usize];
  ["Offset of field: libraw_output_params_t::bright"]
    [::core::mem::offset_of!(libraw_output_params_t, bright) - 128usize];
  ["Offset of field: libraw_output_params_t::threshold"]
    [::core::mem::offset_of!(libraw_output_params_t, threshold) - 132usize];
  ["Offset of field: libraw_output_params_t::half_size"]
    [::core::mem::offset_of!(libraw_output_params_t, half_size) - 136usize];
  ["Offset of field: libraw_output_params_t::four_color_rgb"]
    [::core::mem::offset_of!(libraw_output_params_t, four_color_rgb) - 140usize];
  ["Offset of field: libraw_output_params_t::highlight"]
    [::core::mem::offset_of!(libraw_output_params_t, highlight) - 144usize];
  ["Offset of field: libraw_output_params_t::use_auto_wb"]
    [::core::mem::offset_of!(libraw_output_params_t, use_auto_wb) - 148usize];
  ["Offset of field: libraw_output_params_t::use_camera_wb"]
    [::core::mem::offset_of!(libraw_output_params_t, use_camera_wb) - 152usize];
  ["Offset of field: libraw_output_params_t::use_camera_matrix"]
    [::core::mem::offset_of!(libraw_output_params_t, use_camera_matrix) - 156usize];
  ["Offset of field: libraw_output_params_t::output_color"]
    [::core::mem::offset_of!(libraw_output_params_t, output_color) - 160usize];
  ["Offset of field: libraw_output_params_t::output_profile"]
    [::core::mem::offset_of!(libraw_output_params_t, output_profile) - 168usize];
  ["Offset of field: libraw_output_params_t::camera_profile"]
    [::core::mem::offset_of!(libraw_output_params_t, camera_profile) - 176usize];
  ["Offset of field: libraw_output_params_t::bad_pixels"]
    [::core::mem::offset_of!(libraw_output_params_t, bad_pixels) - 184usize];
  ["Offset of field: libraw_output_params_t::dark_frame"]
    [::core::mem::offset_of!(libraw_output_params_t, dark_frame) - 192usize];
  ["Offset of field: libraw_output_params_t::output_bps"]
    [::core::mem::offset_of!(libraw_output_params_t, output_bps) - 200usize];
  ["Offset of field: libraw_output_params_t::output_tiff"]
    [::core::mem::offset_of!(libraw_output_params_t, output_tiff) - 204usize];
  ["Offset of field: libraw_output_params_t::output_flags"]
    [::core::mem::offset_of!(libraw_output_params_t, output_flags) - 208usize];
  ["Offset of field: libraw_output_params_t::user_flip"]
    [::core::mem::offset_of!(libraw_output_params_t, user_flip) - 212usize];
  ["Offset of field: libraw_output_params_t::user_qual"]
    [::core::mem::offset_of!(libraw_output_params_t, user_qual) - 216usize];
  ["Offset of field: libraw_output_params_t::user_black"]
    [::core::mem::offset_of!(libraw_output_params_t, user_black) - 220usize];
  ["Offset of field: libraw_output_params_t::user_cblack"]
    [::core::mem::offset_of!(libraw_output_params_t, user_cblack) - 224usize];
  ["Offset of field: libraw_output_params_t::user_sat"]
    [::core::mem::offset_of!(libraw_output_params_t, user_sat) - 240usize];
  ["Offset of field: libraw_output_params_t::med_passes"]
    [::core::mem::offset_of!(libraw_output_params_t, med_passes) - 244usize];
  ["Offset of field: libraw_output_params_t::auto_bright_thr"]
    [::core::mem::offset_of!(libraw_output_params_t, auto_bright_thr) - 248usize];
  ["Offset of field: libraw_output_params_t::adjust_maximum_thr"]
    [::core::mem::offset_of!(libraw_output_params_t, adjust_maximum_thr) - 252usize];
  ["Offset of field: libraw_output_params_t::no_auto_bright"]
    [::core::mem::offset_of!(libraw_output_params_t, no_auto_bright) - 256usize];
  ["Offset of field: libraw_output_params_t::use_fuji_rotate"]
    [::core::mem::offset_of!(libraw_output_params_t, use_fuji_rotate) - 260usize];
  ["Offset of field: libraw_output_params_t::use_p1_correction"]
    [::core::mem::offset_of!(libraw_output_params_t, use_p1_correction) - 264usize];
  ["Offset of field: libraw_output_params_t::green_matching"]
    [::core::mem::offset_of!(libraw_output_params_t, green_matching) - 268usize];
  ["Offset of field: libraw_output_params_t::dcb_iterations"]
    [::core::mem::offset_of!(libraw_output_params_t, dcb_iterations) - 272usize];
  ["Offset of field: libraw_output_params_t::dcb_enhance_fl"]
    [::core::mem::offset_of!(libraw_output_params_t, dcb_enhance_fl) - 276usize];
  ["Offset of field: libraw_output_params_t::fbdd_noiserd"]
    [::core::mem::offset_of!(libraw_output_params_t, fbdd_noiserd) - 280usize];
  ["Offset of field: libraw_output_params_t::exp_correc"]
    [::core::mem::offset_of!(libraw_output_params_t, exp_correc) - 284usize];
  ["Offset of field: libraw_output_params_t::exp_shift"]
    [::core::mem::offset_of!(libraw_output_params_t, exp_shift) - 288usize];
  ["Offset of field: libraw_output_params_t::exp_preser"]
    [::core::mem::offset_of!(libraw_output_params_t, exp_preser) - 292usize];
  ["Offset of field: libraw_output_params_t::no_auto_scale"]
    [::core::mem::offset_of!(libraw_output_params_t, no_auto_scale) - 296usize];
  ["Offset of field: libraw_output_params_t::no_interpolation"]
    [::core::mem::offset_of!(libraw_output_params_t, no_interpolation) - 300usize];
};
impl Default for libraw_output_params_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_raw_unpack_params_t {
  pub use_rawspeed: ::core::ffi::c_int,
  pub use_dngsdk: ::core::ffi::c_int,
  pub options: ::core::ffi::c_uint,
  pub shot_select: ::core::ffi::c_uint,
  pub specials: ::core::ffi::c_uint,
  pub max_raw_memory_mb: ::core::ffi::c_uint,
  pub sony_arw2_posterization_thr: ::core::ffi::c_int,
  pub coolscan_nef_gamma: f32,
  pub p4shot_order: [::core::ffi::c_char; 5usize],
  pub custom_camera_strings: *mut *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_raw_unpack_params_t"]
    [::core::mem::size_of::<libraw_raw_unpack_params_t>() - 48usize];
  ["Alignment of libraw_raw_unpack_params_t"]
    [::core::mem::align_of::<libraw_raw_unpack_params_t>() - 8usize];
  ["Offset of field: libraw_raw_unpack_params_t::use_rawspeed"]
    [::core::mem::offset_of!(libraw_raw_unpack_params_t, use_rawspeed) - 0usize];
  ["Offset of field: libraw_raw_unpack_params_t::use_dngsdk"]
    [::core::mem::offset_of!(libraw_raw_unpack_params_t, use_dngsdk) - 4usize];
  ["Offset of field: libraw_raw_unpack_params_t::options"]
    [::core::mem::offset_of!(libraw_raw_unpack_params_t, options) - 8usize];
  ["Offset of field: libraw_raw_unpack_params_t::shot_select"]
    [::core::mem::offset_of!(libraw_raw_unpack_params_t, shot_select) - 12usize];
  ["Offset of field: libraw_raw_unpack_params_t::specials"]
    [::core::mem::offset_of!(libraw_raw_unpack_params_t, specials) - 16usize];
  ["Offset of field: libraw_raw_unpack_params_t::max_raw_memory_mb"]
    [::core::mem::offset_of!(libraw_raw_unpack_params_t, max_raw_memory_mb) - 20usize];
  ["Offset of field: libraw_raw_unpack_params_t::sony_arw2_posterization_thr"]
    [::core::mem::offset_of!(libraw_raw_unpack_params_t, sony_arw2_posterization_thr) - 24usize];
  ["Offset of field: libraw_raw_unpack_params_t::coolscan_nef_gamma"]
    [::core::mem::offset_of!(libraw_raw_unpack_params_t, coolscan_nef_gamma) - 28usize];
  ["Offset of field: libraw_raw_unpack_params_t::p4shot_order"]
    [::core::mem::offset_of!(libraw_raw_unpack_params_t, p4shot_order) - 32usize];
  ["Offset of field: libraw_raw_unpack_params_t::custom_camera_strings"]
    [::core::mem::offset_of!(libraw_raw_unpack_params_t, custom_camera_strings) - 40usize];
};
impl Default for libraw_raw_unpack_params_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_rawdata_t {
  pub raw_alloc: *mut ::core::ffi::c_void,
  pub raw_image: *mut ushort,
  pub color4_image: *mut [ushort; 4usize],
  pub color3_image: *mut [ushort; 3usize],
  pub float_image: *mut f32,
  pub float3_image: *mut [f32; 3usize],
  pub float4_image: *mut [f32; 4usize],
  pub ph1_cblack: *mut [::core::ffi::c_short; 2usize],
  pub ph1_rblack: *mut [::core::ffi::c_short; 2usize],
  pub iparams: libraw_iparams_t,
  pub sizes: libraw_image_sizes_t,
  pub ioparams: libraw_internal_output_params_t,
  pub color: libraw_colordata_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_rawdata_t"][::core::mem::size_of::<libraw_rawdata_t>() - 187800usize];
  ["Alignment of libraw_rawdata_t"][::core::mem::align_of::<libraw_rawdata_t>() - 8usize];
  ["Offset of field: libraw_rawdata_t::raw_alloc"]
    [::core::mem::offset_of!(libraw_rawdata_t, raw_alloc) - 0usize];
  ["Offset of field: libraw_rawdata_t::raw_image"]
    [::core::mem::offset_of!(libraw_rawdata_t, raw_image) - 8usize];
  ["Offset of field: libraw_rawdata_t::color4_image"]
    [::core::mem::offset_of!(libraw_rawdata_t, color4_image) - 16usize];
  ["Offset of field: libraw_rawdata_t::color3_image"]
    [::core::mem::offset_of!(libraw_rawdata_t, color3_image) - 24usize];
  ["Offset of field: libraw_rawdata_t::float_image"]
    [::core::mem::offset_of!(libraw_rawdata_t, float_image) - 32usize];
  ["Offset of field: libraw_rawdata_t::float3_image"]
    [::core::mem::offset_of!(libraw_rawdata_t, float3_image) - 40usize];
  ["Offset of field: libraw_rawdata_t::float4_image"]
    [::core::mem::offset_of!(libraw_rawdata_t, float4_image) - 48usize];
  ["Offset of field: libraw_rawdata_t::ph1_cblack"]
    [::core::mem::offset_of!(libraw_rawdata_t, ph1_cblack) - 56usize];
  ["Offset of field: libraw_rawdata_t::ph1_rblack"]
    [::core::mem::offset_of!(libraw_rawdata_t, ph1_rblack) - 64usize];
  ["Offset of field: libraw_rawdata_t::iparams"]
    [::core::mem::offset_of!(libraw_rawdata_t, iparams) - 72usize];
  ["Offset of field: libraw_rawdata_t::sizes"]
    [::core::mem::offset_of!(libraw_rawdata_t, sizes) - 512usize];
  ["Offset of field: libraw_rawdata_t::ioparams"]
    [::core::mem::offset_of!(libraw_rawdata_t, ioparams) - 696usize];
  ["Offset of field: libraw_rawdata_t::color"]
    [::core::mem::offset_of!(libraw_rawdata_t, color) - 712usize];
};
impl Default for libraw_rawdata_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_makernotes_lens_t {
  pub LensID: UINT64,
  pub Lens: [::core::ffi::c_char; 128usize],
  pub LensFormat: ushort,
  pub LensMount: ushort,
  pub CamID: UINT64,
  pub CameraFormat: ushort,
  pub CameraMount: ushort,
  pub body: [::core::ffi::c_char; 64usize],
  pub FocalType: ::core::ffi::c_short,
  pub LensFeatures_pre: [::core::ffi::c_char; 16usize],
  pub LensFeatures_suf: [::core::ffi::c_char; 16usize],
  pub MinFocal: f32,
  pub MaxFocal: f32,
  pub MaxAp4MinFocal: f32,
  pub MaxAp4MaxFocal: f32,
  pub MinAp4MinFocal: f32,
  pub MinAp4MaxFocal: f32,
  pub MaxAp: f32,
  pub MinAp: f32,
  pub CurFocal: f32,
  pub CurAp: f32,
  pub MaxAp4CurFocal: f32,
  pub MinAp4CurFocal: f32,
  pub MinFocusDistance: f32,
  pub FocusRangeIndex: f32,
  pub LensFStops: f32,
  pub TeleconverterID: UINT64,
  pub Teleconverter: [::core::ffi::c_char; 128usize],
  pub AdapterID: UINT64,
  pub Adapter: [::core::ffi::c_char; 128usize],
  pub AttachmentID: UINT64,
  pub Attachment: [::core::ffi::c_char; 128usize],
  pub FocalUnits: ushort,
  pub FocalLengthIn35mmFormat: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_makernotes_lens_t"]
    [::core::mem::size_of::<libraw_makernotes_lens_t>() - 736usize];
  ["Alignment of libraw_makernotes_lens_t"]
    [::core::mem::align_of::<libraw_makernotes_lens_t>() - 8usize];
  ["Offset of field: libraw_makernotes_lens_t::LensID"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, LensID) - 0usize];
  ["Offset of field: libraw_makernotes_lens_t::Lens"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, Lens) - 8usize];
  ["Offset of field: libraw_makernotes_lens_t::LensFormat"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, LensFormat) - 136usize];
  ["Offset of field: libraw_makernotes_lens_t::LensMount"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, LensMount) - 138usize];
  ["Offset of field: libraw_makernotes_lens_t::CamID"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, CamID) - 144usize];
  ["Offset of field: libraw_makernotes_lens_t::CameraFormat"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, CameraFormat) - 152usize];
  ["Offset of field: libraw_makernotes_lens_t::CameraMount"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, CameraMount) - 154usize];
  ["Offset of field: libraw_makernotes_lens_t::body"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, body) - 156usize];
  ["Offset of field: libraw_makernotes_lens_t::FocalType"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, FocalType) - 220usize];
  ["Offset of field: libraw_makernotes_lens_t::LensFeatures_pre"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, LensFeatures_pre) - 222usize];
  ["Offset of field: libraw_makernotes_lens_t::LensFeatures_suf"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, LensFeatures_suf) - 238usize];
  ["Offset of field: libraw_makernotes_lens_t::MinFocal"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, MinFocal) - 256usize];
  ["Offset of field: libraw_makernotes_lens_t::MaxFocal"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, MaxFocal) - 260usize];
  ["Offset of field: libraw_makernotes_lens_t::MaxAp4MinFocal"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, MaxAp4MinFocal) - 264usize];
  ["Offset of field: libraw_makernotes_lens_t::MaxAp4MaxFocal"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, MaxAp4MaxFocal) - 268usize];
  ["Offset of field: libraw_makernotes_lens_t::MinAp4MinFocal"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, MinAp4MinFocal) - 272usize];
  ["Offset of field: libraw_makernotes_lens_t::MinAp4MaxFocal"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, MinAp4MaxFocal) - 276usize];
  ["Offset of field: libraw_makernotes_lens_t::MaxAp"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, MaxAp) - 280usize];
  ["Offset of field: libraw_makernotes_lens_t::MinAp"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, MinAp) - 284usize];
  ["Offset of field: libraw_makernotes_lens_t::CurFocal"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, CurFocal) - 288usize];
  ["Offset of field: libraw_makernotes_lens_t::CurAp"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, CurAp) - 292usize];
  ["Offset of field: libraw_makernotes_lens_t::MaxAp4CurFocal"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, MaxAp4CurFocal) - 296usize];
  ["Offset of field: libraw_makernotes_lens_t::MinAp4CurFocal"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, MinAp4CurFocal) - 300usize];
  ["Offset of field: libraw_makernotes_lens_t::MinFocusDistance"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, MinFocusDistance) - 304usize];
  ["Offset of field: libraw_makernotes_lens_t::FocusRangeIndex"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, FocusRangeIndex) - 308usize];
  ["Offset of field: libraw_makernotes_lens_t::LensFStops"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, LensFStops) - 312usize];
  ["Offset of field: libraw_makernotes_lens_t::TeleconverterID"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, TeleconverterID) - 320usize];
  ["Offset of field: libraw_makernotes_lens_t::Teleconverter"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, Teleconverter) - 328usize];
  ["Offset of field: libraw_makernotes_lens_t::AdapterID"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, AdapterID) - 456usize];
  ["Offset of field: libraw_makernotes_lens_t::Adapter"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, Adapter) - 464usize];
  ["Offset of field: libraw_makernotes_lens_t::AttachmentID"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, AttachmentID) - 592usize];
  ["Offset of field: libraw_makernotes_lens_t::Attachment"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, Attachment) - 600usize];
  ["Offset of field: libraw_makernotes_lens_t::FocalUnits"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, FocalUnits) - 728usize];
  ["Offset of field: libraw_makernotes_lens_t::FocalLengthIn35mmFormat"]
    [::core::mem::offset_of!(libraw_makernotes_lens_t, FocalLengthIn35mmFormat) - 732usize];
};
impl Default for libraw_makernotes_lens_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_nikonlens_t {
  pub EffectiveMaxAp: f32,
  pub LensIDNumber: uchar,
  pub LensFStops: uchar,
  pub MCUVersion: uchar,
  pub LensType: uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_nikonlens_t"][::core::mem::size_of::<libraw_nikonlens_t>() - 8usize];
  ["Alignment of libraw_nikonlens_t"][::core::mem::align_of::<libraw_nikonlens_t>() - 4usize];
  ["Offset of field: libraw_nikonlens_t::EffectiveMaxAp"]
    [::core::mem::offset_of!(libraw_nikonlens_t, EffectiveMaxAp) - 0usize];
  ["Offset of field: libraw_nikonlens_t::LensIDNumber"]
    [::core::mem::offset_of!(libraw_nikonlens_t, LensIDNumber) - 4usize];
  ["Offset of field: libraw_nikonlens_t::LensFStops"]
    [::core::mem::offset_of!(libraw_nikonlens_t, LensFStops) - 5usize];
  ["Offset of field: libraw_nikonlens_t::MCUVersion"]
    [::core::mem::offset_of!(libraw_nikonlens_t, MCUVersion) - 6usize];
  ["Offset of field: libraw_nikonlens_t::LensType"]
    [::core::mem::offset_of!(libraw_nikonlens_t, LensType) - 7usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct libraw_dnglens_t {
  pub MinFocal: f32,
  pub MaxFocal: f32,
  pub MaxAp4MinFocal: f32,
  pub MaxAp4MaxFocal: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_dnglens_t"][::core::mem::size_of::<libraw_dnglens_t>() - 16usize];
  ["Alignment of libraw_dnglens_t"][::core::mem::align_of::<libraw_dnglens_t>() - 4usize];
  ["Offset of field: libraw_dnglens_t::MinFocal"]
    [::core::mem::offset_of!(libraw_dnglens_t, MinFocal) - 0usize];
  ["Offset of field: libraw_dnglens_t::MaxFocal"]
    [::core::mem::offset_of!(libraw_dnglens_t, MaxFocal) - 4usize];
  ["Offset of field: libraw_dnglens_t::MaxAp4MinFocal"]
    [::core::mem::offset_of!(libraw_dnglens_t, MaxAp4MinFocal) - 8usize];
  ["Offset of field: libraw_dnglens_t::MaxAp4MaxFocal"]
    [::core::mem::offset_of!(libraw_dnglens_t, MaxAp4MaxFocal) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_lensinfo_t {
  pub MinFocal: f32,
  pub MaxFocal: f32,
  pub MaxAp4MinFocal: f32,
  pub MaxAp4MaxFocal: f32,
  pub EXIF_MaxAp: f32,
  pub LensMake: [::core::ffi::c_char; 128usize],
  pub Lens: [::core::ffi::c_char; 128usize],
  pub LensSerial: [::core::ffi::c_char; 128usize],
  pub InternalLensSerial: [::core::ffi::c_char; 128usize],
  pub FocalLengthIn35mmFormat: ushort,
  pub nikon: libraw_nikonlens_t,
  pub dng: libraw_dnglens_t,
  pub makernotes: libraw_makernotes_lens_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_lensinfo_t"][::core::mem::size_of::<libraw_lensinfo_t>() - 1296usize];
  ["Alignment of libraw_lensinfo_t"][::core::mem::align_of::<libraw_lensinfo_t>() - 8usize];
  ["Offset of field: libraw_lensinfo_t::MinFocal"]
    [::core::mem::offset_of!(libraw_lensinfo_t, MinFocal) - 0usize];
  ["Offset of field: libraw_lensinfo_t::MaxFocal"]
    [::core::mem::offset_of!(libraw_lensinfo_t, MaxFocal) - 4usize];
  ["Offset of field: libraw_lensinfo_t::MaxAp4MinFocal"]
    [::core::mem::offset_of!(libraw_lensinfo_t, MaxAp4MinFocal) - 8usize];
  ["Offset of field: libraw_lensinfo_t::MaxAp4MaxFocal"]
    [::core::mem::offset_of!(libraw_lensinfo_t, MaxAp4MaxFocal) - 12usize];
  ["Offset of field: libraw_lensinfo_t::EXIF_MaxAp"]
    [::core::mem::offset_of!(libraw_lensinfo_t, EXIF_MaxAp) - 16usize];
  ["Offset of field: libraw_lensinfo_t::LensMake"]
    [::core::mem::offset_of!(libraw_lensinfo_t, LensMake) - 20usize];
  ["Offset of field: libraw_lensinfo_t::Lens"]
    [::core::mem::offset_of!(libraw_lensinfo_t, Lens) - 148usize];
  ["Offset of field: libraw_lensinfo_t::LensSerial"]
    [::core::mem::offset_of!(libraw_lensinfo_t, LensSerial) - 276usize];
  ["Offset of field: libraw_lensinfo_t::InternalLensSerial"]
    [::core::mem::offset_of!(libraw_lensinfo_t, InternalLensSerial) - 404usize];
  ["Offset of field: libraw_lensinfo_t::FocalLengthIn35mmFormat"]
    [::core::mem::offset_of!(libraw_lensinfo_t, FocalLengthIn35mmFormat) - 532usize];
  ["Offset of field: libraw_lensinfo_t::nikon"]
    [::core::mem::offset_of!(libraw_lensinfo_t, nikon) - 536usize];
  ["Offset of field: libraw_lensinfo_t::dng"]
    [::core::mem::offset_of!(libraw_lensinfo_t, dng) - 544usize];
  ["Offset of field: libraw_lensinfo_t::makernotes"]
    [::core::mem::offset_of!(libraw_lensinfo_t, makernotes) - 560usize];
};
impl Default for libraw_lensinfo_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_makernotes_t {
  pub canon: libraw_canon_makernotes_t,
  pub nikon: libraw_nikon_makernotes_t,
  pub hasselblad: libraw_hasselblad_makernotes_t,
  pub fuji: libraw_fuji_info_t,
  pub olympus: libraw_olympus_makernotes_t,
  pub sony: libraw_sony_info_t,
  pub kodak: libraw_kodak_makernotes_t,
  pub panasonic: libraw_panasonic_makernotes_t,
  pub pentax: libraw_pentax_makernotes_t,
  pub phaseone: libraw_p1_makernotes_t,
  pub ricoh: libraw_ricoh_makernotes_t,
  pub samsung: libraw_samsung_makernotes_t,
  pub common: libraw_metadata_common_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_makernotes_t"][::core::mem::size_of::<libraw_makernotes_t>() - 3160usize];
  ["Alignment of libraw_makernotes_t"][::core::mem::align_of::<libraw_makernotes_t>() - 8usize];
  ["Offset of field: libraw_makernotes_t::canon"]
    [::core::mem::offset_of!(libraw_makernotes_t, canon) - 0usize];
  ["Offset of field: libraw_makernotes_t::nikon"]
    [::core::mem::offset_of!(libraw_makernotes_t, nikon) - 168usize];
  ["Offset of field: libraw_makernotes_t::hasselblad"]
    [::core::mem::offset_of!(libraw_makernotes_t, hasselblad) - 464usize];
  ["Offset of field: libraw_makernotes_t::fuji"]
    [::core::mem::offset_of!(libraw_makernotes_t, fuji) - 848usize];
  ["Offset of field: libraw_makernotes_t::olympus"]
    [::core::mem::offset_of!(libraw_makernotes_t, olympus) - 1200usize];
  ["Offset of field: libraw_makernotes_t::sony"]
    [::core::mem::offset_of!(libraw_makernotes_t, sony) - 1664usize];
  ["Offset of field: libraw_makernotes_t::kodak"]
    [::core::mem::offset_of!(libraw_makernotes_t, kodak) - 1848usize];
  ["Offset of field: libraw_makernotes_t::panasonic"]
    [::core::mem::offset_of!(libraw_makernotes_t, panasonic) - 2092usize];
  ["Offset of field: libraw_makernotes_t::pentax"]
    [::core::mem::offset_of!(libraw_makernotes_t, pentax) - 2160usize];
  ["Offset of field: libraw_makernotes_t::phaseone"]
    [::core::mem::offset_of!(libraw_makernotes_t, phaseone) - 2196usize];
  ["Offset of field: libraw_makernotes_t::ricoh"]
    [::core::mem::offset_of!(libraw_makernotes_t, ricoh) - 2648usize];
  ["Offset of field: libraw_makernotes_t::samsung"]
    [::core::mem::offset_of!(libraw_makernotes_t, samsung) - 2720usize];
  ["Offset of field: libraw_makernotes_t::common"]
    [::core::mem::offset_of!(libraw_makernotes_t, common) - 2856usize];
};
impl Default for libraw_makernotes_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_shootinginfo_t {
  pub DriveMode: ::core::ffi::c_short,
  pub FocusMode: ::core::ffi::c_short,
  pub MeteringMode: ::core::ffi::c_short,
  pub AFPoint: ::core::ffi::c_short,
  pub ExposureMode: ::core::ffi::c_short,
  pub ExposureProgram: ::core::ffi::c_short,
  pub ImageStabilization: ::core::ffi::c_short,
  pub BodySerial: [::core::ffi::c_char; 64usize],
  pub InternalBodySerial: [::core::ffi::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_shootinginfo_t"][::core::mem::size_of::<libraw_shootinginfo_t>() - 142usize];
  ["Alignment of libraw_shootinginfo_t"][::core::mem::align_of::<libraw_shootinginfo_t>() - 2usize];
  ["Offset of field: libraw_shootinginfo_t::DriveMode"]
    [::core::mem::offset_of!(libraw_shootinginfo_t, DriveMode) - 0usize];
  ["Offset of field: libraw_shootinginfo_t::FocusMode"]
    [::core::mem::offset_of!(libraw_shootinginfo_t, FocusMode) - 2usize];
  ["Offset of field: libraw_shootinginfo_t::MeteringMode"]
    [::core::mem::offset_of!(libraw_shootinginfo_t, MeteringMode) - 4usize];
  ["Offset of field: libraw_shootinginfo_t::AFPoint"]
    [::core::mem::offset_of!(libraw_shootinginfo_t, AFPoint) - 6usize];
  ["Offset of field: libraw_shootinginfo_t::ExposureMode"]
    [::core::mem::offset_of!(libraw_shootinginfo_t, ExposureMode) - 8usize];
  ["Offset of field: libraw_shootinginfo_t::ExposureProgram"]
    [::core::mem::offset_of!(libraw_shootinginfo_t, ExposureProgram) - 10usize];
  ["Offset of field: libraw_shootinginfo_t::ImageStabilization"]
    [::core::mem::offset_of!(libraw_shootinginfo_t, ImageStabilization) - 12usize];
  ["Offset of field: libraw_shootinginfo_t::BodySerial"]
    [::core::mem::offset_of!(libraw_shootinginfo_t, BodySerial) - 14usize];
  ["Offset of field: libraw_shootinginfo_t::InternalBodySerial"]
    [::core::mem::offset_of!(libraw_shootinginfo_t, InternalBodySerial) - 78usize];
};
impl Default for libraw_shootinginfo_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct libraw_data_t {
  pub image: *mut [ushort; 4usize],
  pub sizes: libraw_image_sizes_t,
  pub idata: libraw_iparams_t,
  pub lens: libraw_lensinfo_t,
  pub makernotes: libraw_makernotes_t,
  pub shootinginfo: libraw_shootinginfo_t,
  pub params: libraw_output_params_t,
  pub rawparams: libraw_raw_unpack_params_t,
  pub progress_flags: ::core::ffi::c_uint,
  pub process_warnings: ::core::ffi::c_uint,
  pub color: libraw_colordata_t,
  pub other: libraw_imgother_t,
  pub thumbnail: libraw_thumbnail_t,
  pub thumbs_list: libraw_thumbnail_list_t,
  pub rawdata: libraw_rawdata_t,
  pub parent_class: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of libraw_data_t"][::core::mem::size_of::<libraw_data_t>() - 381576usize];
  ["Alignment of libraw_data_t"][::core::mem::align_of::<libraw_data_t>() - 8usize];
  ["Offset of field: libraw_data_t::image"][::core::mem::offset_of!(libraw_data_t, image) - 0usize];
  ["Offset of field: libraw_data_t::sizes"][::core::mem::offset_of!(libraw_data_t, sizes) - 8usize];
  ["Offset of field: libraw_data_t::idata"]
    [::core::mem::offset_of!(libraw_data_t, idata) - 192usize];
  ["Offset of field: libraw_data_t::lens"][::core::mem::offset_of!(libraw_data_t, lens) - 632usize];
  ["Offset of field: libraw_data_t::makernotes"]
    [::core::mem::offset_of!(libraw_data_t, makernotes) - 1928usize];
  ["Offset of field: libraw_data_t::shootinginfo"]
    [::core::mem::offset_of!(libraw_data_t, shootinginfo) - 5088usize];
  ["Offset of field: libraw_data_t::params"]
    [::core::mem::offset_of!(libraw_data_t, params) - 5232usize];
  ["Offset of field: libraw_data_t::rawparams"]
    [::core::mem::offset_of!(libraw_data_t, rawparams) - 5536usize];
  ["Offset of field: libraw_data_t::progress_flags"]
    [::core::mem::offset_of!(libraw_data_t, progress_flags) - 5584usize];
  ["Offset of field: libraw_data_t::process_warnings"]
    [::core::mem::offset_of!(libraw_data_t, process_warnings) - 5588usize];
  ["Offset of field: libraw_data_t::color"]
    [::core::mem::offset_of!(libraw_data_t, color) - 5592usize];
  ["Offset of field: libraw_data_t::other"]
    [::core::mem::offset_of!(libraw_data_t, other) - 192680usize];
  ["Offset of field: libraw_data_t::thumbnail"]
    [::core::mem::offset_of!(libraw_data_t, thumbnail) - 193480usize];
  ["Offset of field: libraw_data_t::thumbs_list"]
    [::core::mem::offset_of!(libraw_data_t, thumbs_list) - 193504usize];
  ["Offset of field: libraw_data_t::rawdata"]
    [::core::mem::offset_of!(libraw_data_t, rawdata) - 193768usize];
  ["Offset of field: libraw_data_t::parent_class"]
    [::core::mem::offset_of!(libraw_data_t, parent_class) - 381568usize];
};
impl Default for libraw_data_t {
  fn default() -> Self {
    let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
    unsafe {
      ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
      s.assume_init()
    }
  }
}
unsafe extern "C" {
  pub fn libraw_strerror(errorcode: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
  pub fn libraw_init(flags: ::core::ffi::c_uint) -> *mut libraw_data_t;
}
unsafe extern "C" {
  pub fn libraw_open_file(
    arg1: *mut libraw_data_t,
    arg2: *const ::core::ffi::c_char,
  ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
  pub fn libraw_open_buffer(
    arg1: *mut libraw_data_t,
    buffer: *const ::core::ffi::c_void,
    size: usize,
  ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
  pub fn libraw_unpack(arg1: *mut libraw_data_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
